{
  "title": "Apple Pie",
  "instructions": "Use foil on bottom of oven rather than a cookie sheet under pie pan.\nPrepare pastry for single-crust pie.\nPlace in pie plate and trim and crimp the edge; refrigerate 30 minute loosely covered with plastic wrap.\nIn a large mixing bowl, stir together the sugar, flour, cinnamon, nutmeg, allspice, and salt.\nAdd apple slices and gently toss until they are coated well.\nTransfer mixture to pie.\nFOR CRUMB TOPPING: Stir together brown sugar, flour, and oats.\nUsing a pastry blender, cut in the butter until topping resembles coarse crumbs.\nSprinkle over apple mixture in pie.\nTo prevent over-browning while baking, cover edge of pie with foil.\nBake at 375 degrees Fahrenheit for 25 minutes.\nRemove foil and bake 25 to 30 minutes more, or until top is golden.\nRemove from oven.\nCool on wire rack about an hour and serve!",
  "ingredients": ["For Pie", "pastry for single-crust pie", "1⁄2 cup sugar", "3 tablespoons flour", "1⁄4 teaspoon cinnamon", "1⁄4 teaspoon nutmeg", "1⁄8 teaspoon allspice", "1⁄8 teaspoon salt", "6 cups thinly sliced peeled apples (1/2 Macintosh, 1/2 Granny Smith)", "Crumb Topping", "2⁄3 cup packed brown sugar", "1⁄2 cup flour", "3⁄4 cup quick-cooking rolled oats", "1⁄2 cup butter", "1⁄4 cup toasted pecans, chopped"],
  "yields": "8 serving(s)",
  "total_time": 70,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/31/12/8/t4sT7E0wT05Kd3ncgzOe_AP%2010%20-%20final_4.png"
}, {
  "title": "Baby Back Ribs",
  "instructions": "Tear off 4 pieces of aluminum foil big enough to enclose each portion of ribs.\nSpray each piece of foil with vegetable cooking spray.\nBrush the ribs liberally with barbecue sauce and place each portion in its own piece of foil.\nWrap tightly and refrigerate for at least 8 hours, or overnight.\nPreheat oven to 300°F (150°C).\nBake ribs wrapped tightly in the foil at 300°F (150°C) for 2 1/2 hours.\nRemove from foil and add more sauce, if desired.",
  "ingredients": ["2 lbs pork baby back ribs", "1 (18 ounce) bottle barbecue sauce"],
  "yields": "4 serving(s)",
  "total_time": 630,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/58/69/1/9xoDoeQbPCprWNyAwqAm_ribs%20(3%20of%204).jpg"
}, {
  "title": "Baklava",
  "instructions": "Make syrup first so that it can come to room temperature:  In a small saucepan, combine honey, sugar and water.  Bring to a slow boil, stirring occasionally, until the sugar is dissolved.  Add lemon juice, cinnamon sticks and peels and cook over a medium heat for 10 minutes, until slightly thickened.  Remove peels and cinnamon sticks and allow to come to room temperature before using.\nCombine walnuts, almonds, sugar, cinnamon, nutmeg, ground cloves and 3 tablespoons melted butter together in a bowl and mix thoroughly.\nPlace phyllo between sheets of waxed paper and cover with a slightly damp towel to prevent phyllo from drying out.  Brush bottom and sides of an 18x12-inch inch pan generously with melted butter.\nPlace 8 phyllo sheets into bottom of pan, brushing each sheet generously with butter.  Take an additional 4 sheets of phyllo and place in pan allowing sheets to drape over each of the 4 sides of pan.  Brush these with melted butter.\nSpread 2 cups of nut mixture into pan, distributing evenly over bottom.  Fold over the overlapping phyllo sheets brushing each with butter, to envelop the nut mixture.\nRepeat layering process 2 more times to form 3 nut layers.\nTop pastry with remaining phyllo dough and generously brush top layer with melted butter.  Tuck in the buttered phyllo neatly around.\nScore through top layers of pastry with a sharp knife making 6 strips lengthwise then cut 10 strips diagonally to form diamond shaped pieces.  Stud each diamond-shaped piece (and any odd looking ones near the ends of the pan) in the centre with a whole clove per piece.  Pour remaining melted butter over pastry and lightly sprinkle some water on top too (wet your hand under the tap twice and shake this out over the pastry).\nBake pastry in a 325°F oven for 1 hour to 75 minutes, until nicely golden-brown.  Allow to cool for 5 minutes.  Carefully spoon cool syrup over seam in pastry.  Allow to stand at least 3 hours or overnight.  Cut through the scored pieces and serve.\nNote:  The clove studding each piece is not traditionally eaten, it is removed by the person whose piece it is before eating.  The clove is there to add its 'perfume' to the piece as it bakes (and it looks pretty, too).",
  "ingredients": ["Syrup", "2 cups honey (preferably Greek thyme honey, but no biggy if you can't get it. DO use a good quality honey, though)", "1 cup water", "1 cup sugar", "2 cinnamon sticks (or 1/2 teaspoon ground cinnamon)", "1 tablespoon lemon juice", "lemon peel (without pith - 4 inch-long piece)", "orange peel (without pith - 4 inch-long piece)", "Pastry", "4 cups coarsley ground walnuts (very fresh)", "2 cups coarsley ground almonds (make sure the nuts you use are FRESH, very recently purchased)", "4 tablespoons sugar", "1⁄2 teaspoon cinnamon", "1⁄2 teaspoon nutmeg", "1⁄4 teaspoon ground cloves", "3 tablespoons melted butter", "2 lbs phyllo pastry sheets", "1 lb unsalted butter, melted (don't use less, this is what will make your baklava taste exceptional, and it has to be BUTTER!)", "whole cloves"],
  "yields": "",
  "total_time": 100,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/59/86/3/Ye35HYGSEGgc0oGCIUag_Baklava-2.jpg"
}, {
  "title": "Beef Carpaccio",
  "instructions": "The beef should be totally cleaned of fat and sinew to leave you with between 1 1/2 - 1 3/4 lb of topside meat. Mix all the ingredients for the marinade, keeping a few leaves of basil for finish. Roll the beef in the marinade and leave to steep in the fridge for 4-5 days to achieve maximum flavor. The beef should be turned every day.\nAfter the marinating process, remove the meat to a baking sheet. The meat can now be frozen wrapped in plastic wrap and used later or even sliced from frozen. It can also be kept in the fridge wrapped in plastic wrap and sliced thinly with a sharp knife as you want it. The marinade should be sieved and used as the dressing. Chill until ready to plate.\nTo serve the carpaccio, slice very thinly and place the slices on to a chilled plate, covering the whole surface. The remaining basil leaves can be chopped and added to the vinaigrette. Drizzle vinaigrette over the meat. Grind fresh black pepper on to the meat. The Parmesan can be sliced into shavings and laid on top or grated and served separately.",
  "ingredients": ["2 lbs topside of aberdeen angus beef or 2 lbs prime rib roast", "fresh ground black pepper, to taste", "2 ounces parmesan cheese", "For the marinade", "1⁄2 cup balsamic vinegar", "5 tablespoons soy sauce", "5 tablespoons Worcestershire sauce", "4 garlic cloves, chopped", "1 bunch fresh basil", "1⁄2 bunch fresh thyme", "15 black peppercorns, crushed", "1 1⁄4 cups dry white wine", "2 1⁄2 cups olive oil", "1 tablespoon coarse sea salt"],
  "yields": "4 serving(s)",
  "total_time": 7220,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/gk-static/fdc-new/img/fdc-shareGraphic.png"
}, {
  "title": "Beef Tartare",
  "instructions": "For the beef tartare:\nFill a large bowl with ice and place a smaller bowl over the ice. Finely dice the beef and place it in the bowl over the ice. (This will help to keep the meat fresh.) In another large bowl, combine the cheese, olives, oil, mustard, shallots, celery leaves, chives and parsley. Add the beef and stir gently to combine. Season with hot sauce, salt and pepper.\nFor the crispy parsnips:\nHeat the canola oil in a deep fryer to 350 degrees F (180 degrees C). Fry the parsnips until golden brown and crisp. Transfer to a baking sheet lined with paper towels to drain. Season with smoked salt and pepper. To serve, divide the beef tartare among plates and garnish with the crispy parsnips.\nDisclaimer:\nConsumption of raw or undercooked eggs, shellfish and meat may increase the risk of foodborne illness.",
  "ingredients": ["Beef Tartare", "2 pounds/ 1kg beef tenderloin", "1 cup/ 250ml cubed parmigiano-reggiano cheese", "1⁄4 cup/ 60ml garlic-stuffed olives, halved", "3 tablespoons/ 45ml olive oil", "1 tablespoon/ 15ml Dijon mustard", "2 shallots, diced", "1 handful celery leaves", "1 handful fresh chives, finely chopped", "1 handful fresh parsley, chopped", "green chili sauce, such as Tabasco", "salt & freshly ground black pepper", "Crispy Parsnips", "canola oil, for frying", "6 parsnips, peeled and julienned", "smoked salt", "fresh ground black pepper"],
  "yields": "4 serving(s)",
  "total_time": 30,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/submissions/recipe/33186/MmJehBOQQgWnm23jUwTI_CCCDO408_Beef-Tartare_s4x3.jpg.rend.hgtvcom.616.462.jpeg"
}, {
  "title": "Beet Salad",
  "instructions": "Mix all the ingredients together and chill for 2 hours before serving.",
  "ingredients": ["2 cups cooked beets, grated", "4 tablespoons fresh horseradish, grated (can use prepared horseradish but use about 1/2 the amount)", "2 teaspoons sugar", "1 teaspoon salt", "2 teaspoons vinegar", "2 tablespoons salad oil or 2 tablespoons olive oil"],
  "yields": "8 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/37/14/05/picfULMln.jpg"
}, {
  "title": "Beignets",
  "instructions": "Put the warm water into a large bowl, then sprinkle in the yeast and a couple teaspoons of the sugar and stir until thoroughly dissolved.\nLet proof for 10 minutes.\nAdd the rest of the sugar, salt, eggs, and evaporated milk.\nGradually stir in 4 cups of the flour and beat with a wooden spoon until smooth and thoroughly blended.\nBeat in the shortening, then add the remaining flour, about 1/3 cup at a time, beating it in with a spoon until it becomes too stiff to stir, then working in the rest with your hands.\nCover the bowl with plastic wrap and refrigerate overnight in a greased bowl.\nRoll the dough out onto a floured board or marble pastry surface to a thickness of 1/8 inch, then cut it into rectangles 2-1/2 inches by 3-1/2 inches with a sharp knife.\nHeat the oil in a deep fryer to 360 degrees F.\nFry the beignets about 3 or 4 at a time until they are puffed out and golden brown on both sides, about 2-3 minutes per batch.\nTurn them over in the oil with tongs once or twice to get them evenly brown, since they rise to the surface of the oil as soon as they begin to puff out.\nDrain each batch on paper towels, place on a platter lined with several layers of paper towels, and keep warm in a 200 degree F oven until they're all done.\nServe 3 beignets per person, sprinkling heavily with powdered sugar, and serve hot with cafe au lait.",
  "ingredients": ["1 package active dry yeast", "1 1⁄2 cups warm water (100-115 degrees F)", "1⁄2 cup sugar", "1 teaspoon salt", "2 large eggs", "1 cup evaporated milk", "7 cups flour", "1⁄4 cup vegetable shortening", "oil (for deep frying)", "confectioners' sugar, for dusting (or burying, depending on taste)"],
  "yields": "",
  "total_time": 23,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/86/14/4/Sn8kyYJFRRTx3B9gLpZQ_B%204%20-%20final_2.jpg"
}, {
  "title": "Bibimbap",
  "instructions": "In a bowl, stir together soy sauce, 1 tablespoon sesame oil, sugar, garlic, ginger and apple juice. Add beef, stir well, and set aside.\r\nCook rice according to package directions.\r\nIn a skillet, heat 1/2 tbsp sesame oil. Saute zucchini slices until tender, about 5 minutes. Transfer to a bowl. Add 1/2 tbsp oil to skillet. Saute mushrooms until tender, about 5 minutes. Add to zucchini.\r\nBlanch bean sprouts in boiling water for 1 minute; drain well.\r\nCook beef in same skillet (do not add more oil) until fully browned. Set aside.\r\nHeat remaining tablespoon sesame oil in skillet. Add eggs and fry until whites are set but yolks remain runny.\r\nIn a large bowl, place half the rice in a mound in the center. Add half the zucchini, half the mushrooms, half the bean sprouts, and half the carrots around the outside. Sprinkle half the beef over the vegetables. Top with a fried egg. Serve with chili paste and vinegar to taste. When ready to eat, break the yolk and stir everything together thoroughly.",
  "ingredients": ["2 tablespoons soy sauce", "3 tablespoons sesame oil", "2 teaspoons sugar", "1 garlic clove, minced", "1⁄2 teaspoon ginger, grated", "1⁄2 cup apple juice", "1⁄2 lb lean ground beef", "1 cup short-grain rice", "2 eggs", "1⁄2 zucchini, thinly sliced", "1 cup mushroom, thinly sliced", "1⁄2 cup bean sprouts", "1⁄2 cup carrot, julienned", "1⁄4 cup korean chili paste", "2 tablespoons rice wine vinegar"],
  "yields": "2 serving(s)",
  "total_time": 55,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/35/87/97/rbrDItlaQy6UUaYPIIy9_bibimbap2.JPG"
}, {
  "title": "Bread Pudding",
  "instructions": "Whisk together eggs, whipping cream, milk, salt, sugar, and vanilla.\nStir in bread cubes and raisins.\nTurn into greased 9x9 inch pan.\nSprinkle with cinnamon.\nBake 350 degrees F.\nfor about 30 minutes.\nServe with brown sugar sauce or lemon sauce.\nBrown Sugar Sauce: In saucepan, work together flour and butter.\nAdd brown sugar.\nStir.\nGradually add boiling water.\nStir until smooth.\nBoil until thick.\nRemove from heat.\nStir in vanilla, serve warm.\nLemon Sauce: Combine sugar, starch, and salt.\nGradually add boiling water.\nStir until smooth.\nCook over low heat until thick and clear.\nRemove from heat.\nAdd remaining ingredients.\nServe warm.",
  "ingredients": ["3 eggs, beaten", "1 cup whipping cream", "1 cup milk", "3⁄4 cup sugar", "1⁄4 teaspoon salt", "1 teaspoon vanilla", "4 cups stale bread, cubes (white bread is best)", "1⁄2 cup raisins (optional)", "cinnamon", "Brown Sugar Sauce", "2 tablespoons flour", "1 tablespoon butter", "1 cup packed brown sugar", "1 cup boiling water", "1 teaspoon vanilla", "Lemon Sauce", "1⁄2 cup sugar", "1 1⁄2 tablespoons cornstarch", "1⁄8 teaspoon salt", "1 cup boiling water", "2 tablespoons butter", "1⁄2 tablespoon lemon rind, grated", "3 1⁄2 tablespoons fresh lemon juice", "3 -5 drops lemon extract"],
  "yields": "8 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/52/34/9/Ees4h7bnQSmPMAnWlf6b_DSC_0424.jpg"
}, {
  "title": "Breakfast Burrito",
  "instructions": "Scramble eggs, cooking to a dry consistancy.  Cool and put in a mixing bowl.\nBrown sausage, drain fat and cool.  Add to the eggs.\nSaute vegetables until they have released their liquid and it has evaporated.  Cool, add to egg mixture.\nAdd the salsa and cheese, mix to combine.\nHeat tortillas briefly to soften. Scoop 1/3-1/2 cup of filling into each tortilla and roll up.\nPlace each burrito in a zip-top sandwich bag and seal, squeezing out all air.  Place burritos in a freezer safe container and freeze.\nTo reheat, remove frozen burrito from the sandwich bag, place on a microwave safe plate, and cook on full power until heated through, 1 - 1 1/2 minutes.",
  "ingredients": ["12 eggs", "1 lb sausage", "2 cups salsa", "2 cups cheddar cheese, shredded", "8 ounces sliced mushrooms", "1⁄2 onion, minced", "1 bell pepper, chopped finely", "14 (10 inch) tortillas"],
  "yields": "14 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/23/14/76/pic8oH8Zm.jpg"
}, {
  "title": "Bruschetta",
  "instructions": "Cut tomatoes in half, squeeze out seeds and juice.\nChop into small dice and place in bowl.\nAdd onion, garlic, basil, vinegar, half the olive oil, salt and pepper to your taste.\nLet stand at room temperature for about 1 hour,drain liquid.\nOn broil, toast bread on both sides until golden.\nQuickly brush one side of each slice with remaining olive oil.\nSpoon tomato mixture on top& serve.\nNote: My husband usually makes this and i believe he uses the drained liquid to brush the bread rather than the olive oil.\nAlso we have made this using dried basil instead of fresh (1 tablespoons fresh= 1 teaspoons dried) and although it does not call for it in the recipe we also use some fresh parsley.",
  "ingredients": ["1 1⁄2 lbs ripe plum tomatoes (about 8-10)", "2 tablespoons finely chopped onions", "2 garlic cloves, minced", "1⁄4 cup chopped fresh basil", "2 teaspoons red wine vinegar", "6 tablespoons extra virgin olive oil", "salt & pepper", "4 slices thick crusty Italian bread (we usually just use a baguette)"],
  "yields": "",
  "total_time": 70,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/62/87/4/picC1Py3p.jpg"
}, {
  "title": "Caesar Salad",
  "instructions": "Mince and mash the garlic with the anchovies to form a paste and, in a bowl, whisk together paste, yolks, vinegar, mustard, Worcestershire Sauce, salt and lemon juice.\nAdd oil in a stream, whisking, until it is emulsified.\nToss Romaine with Parmesan and croutons in a bowl; add dressing and toss well to coat.\nServe immediately.",
  "ingredients": ["3 cloves garlic", "3 flat anchovy fillets, drained and minced", "2 large egg yolks", "1 tablespoon white wine vinegar", "2 teaspoons red wine vinegar", "1 1⁄2 teaspoons Dijon mustard", "1 teaspoon Worcestershire sauce", "1⁄4 teaspoon salt", "1 tablespoon fresh lemon juice", "3⁄4 cup olive oil", "2 heads romaine lettuce, torn into pieces,rinsed and spun dry", "1⁄2 cup freshly-grated parmesan cheese", "1 cup garlic-flavored croutons (recipe in my cookbook)"],
  "yields": "4 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/61/80/0/4xV3wh9lTb662KkeIEWQ_caesar-salad-4.jpg"
}, {
  "title": "Cannoli",
  "instructions": "To make shells, mix flour, sugar and salt in a bowl.\nCut in butter.\nAdd egg yolks; stir with a fork.\nStir in wine, 1 tablespooon at a time, with a fork until dough clings together.\nForm a ball with the dough and let stand for 30 minutes.\nRoll dough almost paper thin, on a well-floured surface.\nUsing the rim of a margarita glass (about 3-4 inches across), make circle imprints into rolled dough.\nUsing a paring knife, make sure circles are cut all the way through.\nRoll each circle of dough around a metal cannoli tube, overlaping the ends and press to seal, flaring out the edges slightly.\nFry one or two at a time in hot melted shortening (about 360°F) for approximately 1 minute, turning to brown all sides.\nRemove from hot grease and drain on paper towels, seam side down.\nLet cool a minute or two before trying to remove metal tube.\nTo remove the tube hold cannoli shell down on the paper towel and carefully slide the tube out one end.\nLeave cannoil shells on paper towel, seam side down to cool completely.\n~NOTE~Shells can be stored in airtight containers and made several days prior to filling.\nFor filling, drain ricotta cheese over cheesecloth if ricotta is watery.\nCombine ricotta cheese, powdered sugar, and vanilla extract until combined.\nSqueeze Maraschino cherries with paper towels to remove all liquid.\n(If you don't squeeze them good, you will have a pink water filling!).\nStir in cherries and chocolate chips into the ricotta mixture, being careful not to over mix.\nFor a lighter filling, you may whip 1 cup of heavy whipping cream to form stiff peaks, and fold into filling mixture at this step.\nChill filling for about 30 minutes before piping into cooled cannoli shells.\nYou may garnish the cannoli by sprinkling powdered sugar on top.\nWhipped cream, a cherry, and shaved chocolate can also be used to garnish the top.\nKeep refrigerated until time of serving.",
  "ingredients": ["Shells", "4 cups sifted all-purpose flour", "2 tablespoons sugar", "1⁄4 teaspoon salt", "3 tablespoons butter, softened", "2 egg yolks", "3⁄4 cup white wine", "shortening, for frying", "Filling", "4 cups whole milk ricotta cheese", "1 1⁄2 cups powdered sugar", "1 tablespoon vanilla extract", "1⁄3 cup finely chopped maraschino cherry", "1⁄4 cup semisweet mini chocolate chips", "1 cup heavy whipping cream, optional"],
  "yields": "24 serving(s)",
  "total_time": 105,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/95/54/6/DLN9WtsdR9euCddvgrVg_CAN%207%20-%20final_2.jpg"
}, {
  "title": "Caprese Salad",
  "instructions": "Cut tomatoes into 1/4-in. slices and arrange on a plate, alternating tomatoes with mozzarella slices.\r\nScatter basil ribbons over the tomatoes and mozzarella. \r\nDrizzle with olive oil and season to taste with salt and pepper.\r\nNOTE: I would add a bit of balsamic vinegar when I serve it on my plate because it's like the one at Macaroni and Grill.",
  "ingredients": ["4 medium tomatoes (about 1.25 lbs, washed and cored)", "1⁄2 lb fresh mozzarella cheese, sliced thinly", "5 basil leaves (stacked neatly, rolled into a cylinder n cut into thin ribbons)", "2 -3 tablespoons extra virgin olive oil", "salt and pepper", "balsamic vinegar (optional)"],
  "yields": "4 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/29/79/40/Ohfao6IWS6aDnv9bX3ND_caprese-salad-3.jpg"
}, {
  "title": "Carrot Cake",
  "instructions": "Beat oil and sugar, then add eggs.\nAdd and mix the rest of the cake ingredients in the order given Beat for 1 minute.\nPour into 3 9-inch cake pans.\nBake at 350°F for 35 minutes.\nIcing: Mix butter and cream cheese together until smooth, then add sugar a little at a time.\nBeat until smooth.",
  "ingredients": ["1 1⁄2 cups oil", "2 cups sugar", "4 eggs", "2 cups flour", "2 teaspoons baking soda", "1 pinch salt", "3 cups grated carrots (fully packed)", "2 teaspoons cinnamon", "1 teaspoon vanilla", "Icing", "1⁄4 cup butter", "8 ounces cream cheese", "1 lb powdered sugar"],
  "yields": "16 serving(s)",
  "total_time": 45,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/28/68/4/4NuP77rMTpqRuNI5gRl2_6%20-%20final_2.png"
}, {
  "title": "Ceviche",
  "instructions": "Combine all ingredients except red onion and mix well.\nPlace red onion on top and let it marinate in the refrigerator for at least 2-3 hours before serving.\nBefore serving, mix well and serve with lettuce, corn, avocado or other cold salad vegetables on the side.\nIt is important to use a juicer that presses the juice out of the limes, not one that will tear the membrane of the lime sections since this will make the lime juice bitter.",
  "ingredients": ["2 lbs tilapia fillets or 2 lbs other firm white fish fillets, cubed", "8 -10 garlic cloves, chopped", "1 teaspoon salt", "1⁄2 teaspoon black pepper", "2 teaspoons fresh cilantro, chopped", "1 habanero pepper, seeded and chopped (or real Peruvian Aji Amarillo, if you can find it)", "8 -12 limes, freshly squeezed and strained to remove pulp, enough to cover fish", "1 red onion, thinly sliced and rinsed"],
  "yields": "8 serving(s)",
  "total_time": 30,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/11/54/picICEUev.jpg"
}, {
  "title": "Cheesecake",
  "instructions": "For crust, combine graham cracker crumbs and melted butter.\nStir until well combined.\nPress onto bottom and about 2-1/2 inches up the sides of a 9x3-inch springform pan.\nMix cream cheese, sugar, flour, and vanilla.\nBeat with an electric mixer until fluffy.\nAdd eggs and egg yolks, beating on low speed just until combined.\nStir in whipping cream and lemon peel.\nPour into pan.\nPlace pan in a shallow baking pan in the oven. (Does not mention anything about a water bath)\nBake in a 325 degree F oven about 1-1/2 hours or until center appears nearly set when shaken.\nCool 15 minutes.\nLoosen crust from sides of pan.\nCool 30 minutes more; remove sides of pan.\nCool completely.\nChill 4 to 24 hours.\nIf desired, garnish with fresh berries.",
  "ingredients": ["2 cups finely crushed graham cracker crumbs", "1⁄2 cup butter or 1/2 cup margarine, melted", "5 (8 ounce) packages cream cheese, softened", "1 3⁄4 cups sugar", "2 tablespoons all-purpose flour", "1 1⁄2 teaspoons vanilla", "5 eggs", "2 egg yolks", "1⁄3 cup whipping cream", "1 teaspoon finely shredded lemon, rind of"],
  "yields": "16 serving(s)",
  "total_time": 120,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/57/02/5/10PIImsmQwqM1uXdc7FF_cheesecake-cherries-7411.jpg"
}, {
  "title": "Cheese Plate",
  "instructions": "Hazelnut Brittle: Combine sugar and water in a small saucepan and cook over medium-high heat without stirring. As soon as an amber color develops, take off the heat! Caramel can go from perfect to burnt in a matter of seconds. Remove from the heat and stir in hazelnuts. Transfer to a baking sheet lined with a silpat. Let sit until the caramel has hardened, about 20 minutes. Break into small pieces with your hands.\nDark Cherry Jam: Add all ingredients to a bowl and mix. Let macerate for at least 1 hour or overnight. Pour mixture into a small saucepan over medium heat. Let simmer until mixture thickens to a jam consistency, about 40 minutes.\nRoasted Apples: Preheat oven to 350 degrees. Add all ingredients to a large bowl and mix until apples are well covered in butter and seasoning. Pour mixture onto baking sheet and bake until apples are soft and begin to caramelize, 30-40 minutes.\nWild Mushrooms: Melt butter in a saucepan over medium heat. Add garlic and cook until fragrant, about 1 minute. Add mushrooms and Herbes de Provence. Cook until soften and brown. Add salt and pepper to finish. Don’t salt mushrooms until the end or they won’t brown for you!",
  "ingredients": ["Fontina cheese", "1⁄3 cup hazelnuts, skins removed, toasted", "1 cup sugar", "2 tablespoons water", "goat cheese with dark cherry jam", "1⁄2 lb soft fresh goat cheese", "1 cup frozen cherries, thawed", "1⁄4 cup sugar", "1⁄4 teaspoon almond extract", "gorgonzola dolce and roasted apple", "1⁄2 lb gorgonzola dolce blue cheese", "1 cup golden delicious apple, chunks", "1 tablespoon unsalted butter, melted", "2 tablespoons brown sugar", "1⁄4 teaspoon cinnamon", "1⁄4 teaspoon nutmeg", "1⁄4 teaspoon salt", "gouda with wild mushroom", "1⁄2 lb gouda cheese", "1⁄2 lb fresh wild mushroom, of choice (I used royal trumpet, shiitake and porcini)", "1 tablespoon unsalted butter", "2 teaspoons garlic, minced", "1⁄2 teaspoon herbes de provence", "1 teaspoon salt", "1⁄2 teaspoon pepper"],
  "yields": "4 serving(s)",
  "total_time": 180,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/gk-static/fdc-new/img/fdc-shareGraphic.png"
}, {
  "title": "Chicken Curry",
  "instructions": "Mix together flour, salt and cayenne pepper in a plastic bag; add chicken in small batches, shaking to coat.\nHeat oil in a large skillet over medium-high heat.\nAdd chicken and cook until lightly browned; then add curry powder and toss to coat.\nRemove from pan.\nAdd onion and garlic to pan, adding a little more oil if necessary, and cook for 2 minutes, then add broth, raisins, and tomato paste.\nReturn chicken to pan and simmer uncovered for 8 minutes or until chicken is cooked through and sauce has thickened.\nGarnish with cilantro and a dollop of yogurt.\nServe with quick cooking minute rice, if desired.",
  "ingredients": ["2 tablespoons flour", "1 teaspoon salt", "1⁄2 teaspoon cayenne pepper", "1 lb boneless skinless chicken breast, cut into 1 1/2-inch pieces", "2 tablespoons canola oil", "1 tablespoon curry powder", "1 medium onion, sliced", "2 garlic cloves, minced", "1 cup chicken broth", "1⁄3 cup golden raisin", "1 1⁄2 tablespoons tomato paste", "1⁄4 cup chopped fresh cilantro", "1⁄4 cup plain nonfat yogurt"],
  "yields": "4 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/29/30/1/picJSEag1.jpg"
}, {
  "title": "Chicken Quesadilla",
  "instructions": "In a skillet, combine the first 6 ingredients.\nOver medium heat, cook uncovered, for 10 minutes or until heated through, stirring occasionally.\nBrush one side of tortillas with butter.\nSpoon 1/3 cup chicken mixture over half of unbuttered side of each tortilla.\nSprinkle with 1/3 cup of cheese; fold in half.\nPlace on a lightly greased baking sheet.\nBake at 475 degrees for 10 minutes or until crisp and golden brown.\nCut into wedges; serve with sour cream and guacamole.",
  "ingredients": ["2 1⁄2 cups shredded cooked chicken", "2⁄3 cup salsa", "1⁄3 cup sliced green onion", "1 teaspoon ground cumin", "1⁄2 teaspoon salt", "1⁄2 teaspoon dried oregano", "6 8-inch flour tortillas", "1⁄4 cup butter or 1/4 cup margarine, melted", "2 cups shredded monterey jack cheese", "sour cream", "guacamole"],
  "yields": "6 serving(s)",
  "total_time": 55,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/92/4/USE2RMB8TEGKxRsBDANs_chicken%20quesadilla%20SITE-2.jpg"
}, {
  "title": "Chicken Wings",
  "instructions": "Cut wings at joints.\nPreheat oven to 425 degrees.\nBe sure wings are thawed and dry them well with paper towels.\nCombine flour, paprika, garlic salt, black pepper and cayenne pepper in  a plastic bag.\nShake to mix ingredients and add wings.\nLine a large baking sheet with Release foil and melt the butter on it. ( Makes for easy clean up.).\nAdd wings to pan and turn to coat.\nBake for 30 minutes.\nTurn wings over and bake for 15 more minutes or until crispy and done.",
  "ingredients": ["1⁄3 cup flour", "1 tablespoon paprika", "1 teaspoon garlic salt", "1 teaspoon black pepper", "1⁄4 - 1⁄2 teaspoon cayenne pepper", "3 tablespoons butter", "10 chicken wings, tips removed"],
  "yields": "4 serving(s)",
  "total_time": 65,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/40/49/7/iUlxb54sSWaD9Zp44kfP_FGgWFV4mSVq8aISp1eQG_baked%20wings%20(1%20of%204).jpg"
}, {
  "title": "Chocolate Cake",
  "instructions": "CAKE DIRECTIONS: Heat oven to 350 degrees F.\nCombine dry ingredients in large bowl.\nAdd eggs, milk, oil and vanilla.\nBeat on medium speed 2 minutes.\nStir in boiling water (batter will be thin).\nPour into 2 greased and floured 9\" round pans.\nBake 30-35 minutes or until toothpick inserted in center comes out clean.\nCool 10 minutes, then remove to wire racks and cool completely.\nFrost with \"Perfectly Chocolate\" Chocolate Frosting.\nThis also makes about 30 cupcakes.\nFROSTING DIRECTIONS: Melt butter.\nStir in cocoa.\nAlternately add powdered sugar and milk, beating on medium speed to spreading consistency.\nAdd more milk, if needed.",
  "ingredients": ["FOR THE CAKE", "2 cups sugar", "1 3⁄4 cups all-purpose flour", "3⁄4 cup cocoa", "1 1⁄2 teaspoons baking powder", "1 1⁄2 teaspoons baking soda", "1 teaspoon salt", "2 eggs", "1 cup milk", "1⁄2 cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water", "FOR THE FROSTING", "1⁄2 cup butter or 1/2 cup margarine", "2⁄3 cup cocoa", "3 cups powdered sugar", "1⁄3 cup milk", "1 teaspoon vanilla extract"],
  "yields": "8 serving(s)",
  "total_time": 70,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/39/14/99WuYXqfTLi3RopgaCOs_cake2 (1 of 1).jpg"
}, {
  "title": "Chocolate Mousse",
  "instructions": "Melt chocolate and water in saucepan.\nWhisk in the vanilla.\nAllow to cool.\nWhip the cream.\nAdd the confectioner's sugar.\nOn low beater, blend in the chocolate.\nScoop the Chocolate Mousse into a clear, glass bowl.\nGarnish with grated chocolate or some of the chocolate from the pan drizzled on top.",
  "ingredients": ["8 ounces chocolate chips", "6 tablespoons water", "2 teaspoons vanilla", "2 cups whipping cream", "1⁄4 cup confectioners' sugar"],
  "yields": "10 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/89/95/omZbv836RCmfVJbCHwx8-Chocolate-Mousse---8995--1.JPG"
}, {
  "title": "Churros",
  "instructions": "Hot Chocolate Dipping Sauce:\nBring the water and sugar to a boil in a saucepan over med-high heat.\nAdd the semisweet and bittersweet chocolate, cocoa and milk and lower the heat to med-low.\nStir constantly with a wooden spoon until the chocolate is thick and smooth, about 5 minutes.\nReserve.\nChurros:\nBring the water, oil and salt to a boil in a saucepan over med-high heat.\nAdd the flour all at once and stir vigorously with a wooden spoon until a smooth ball forms.\nLower the heat and cook, flattening and turning the dough for 2 minutes.\nCool and transfer to a pastry bag fitted with a 3/8 inch star tip (the fluted edge is essential).\nPour the oil to a depth of at least 1 inch in a skillet (or use a deep fryer) and heat on high until the oil quickly browns a cube of test bread.\nSqueeze 5 inch lengths of dough through the pastry tube into the oil - as many as will comfortably fit.\nReduce the heat to  med-high and fry until the churros puff and have barely begun to turn golden, about 20 seconds. *Do not overcook - the churros should be crunchy outside and soft within.*.\nDrain on paper towels. (If needed, you can keep them warm briefly in a 200 degee F. oven until ready to serve.).\nDredge the churros in the sugar and arrange 4 on each plate.\nTo serve, reheat the chocolate over very low heat and divide into 6 espresso or small cups placed off center on 6 dessert plates.\nDip away!",
  "ingredients": ["Hot Choclate Dipping Sauce", "1⁄2 cup water", "1⁄4 cup sugar", "1 cup good quality semisweet chocolate morsel", "1⁄4 cup bittersweet chocolate chips", "1 tablespoon good-quality cocoa powder", "1⁄4 cup whole milk", "Churros", "1 cup water", "1 1⁄2 teaspoons mild olive oil", "1⁄4 teaspoon kosher salt", "1 cup unbleached flour", "mild olive oil (for frying)", "granulated sugar, for dusting"],
  "yields": "6 serving(s)",
  "total_time": 45,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/37/11/45/CAf3mBMxT0qmbnDxrLGX_Churros%20w%20Choc%20Sauce%20copy.jpg"
}, {
  "title": "Clam Chowder",
  "instructions": "Add bacon to sauce pan and cook on medium low heat until crispy.\nAdd onion and cook until translucent.\nAdd clam juice from both cans.\nAdd potatoes.\nCook and cover until potatoes are fork tender, about 15-20 minutes.\nStir occasionally so potatoes won't stick.\nAdd clams, soup, cream, milk, and dill weed.\nStir together.\nAdd butter and let melt into the chowder.\nCook for about 30-45 minutes or until thickened.\nStir occasionally.",
  "ingredients": ["6 -7 pieces bacon, cut into small pieces", "1 medium onion, chopped", "2 (5 ounce) cans baby clams, with juice reserved", "6 -7 potatoes, cubed", "2 (10 1/2 ounce) cans cream of celery soup", "1 cup heavy cream", "1 cup milk", "1 tablespoon butter", "1 teaspoon dried dill weed"],
  "yields": "6 serving(s)",
  "total_time": 75,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/52/27/2/c6fmjvRQxGUOJdQMXdAl-Clam-Chowder---52272-3.JPG"
}, {
  "title": "Club Sandwich",
  "instructions": "Spread mayonnaise on one side of a piece of toast; add layer of American cheese, ham, two slices of tomato, two leaves of lettuce, and two pieces of bacon.\nSpread mayonnaise on second piece of toast and place on top, mayo side down.\nSpread mayonnaise on top of that second piece of toast.\nLayer Monterey Jack cheese, the rest of the tomatoes, lettuce, turkey and bacon on top.\nSpread mayonnaise on third piece of toast and place on the stack mayo side down.\nSlice the sandwich in quarters diagonally.\nSkewers or long toothpicks may be used to hold all the layers together.",
  "ingredients": ["3 slices toasted bread", "2 tablespoons mayonnaise", "2 slices American cheese", "4 slices shaved ham", "4 tomatoes, sliced, divided", "4 leaves lettuce, divided", "4 slices crisp bacon, divided", "2 slices monterey jack cheese", "4 slices shaved deli turkey"],
  "yields": "1 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/33/69/nyRO9yRLSFS0kr28n2z2_CS%204%20-%20final_2.jpg"
}, {
  "title": "Crab Cakes",
  "instructions": "Mix together eggs, mayo, OLD BAY, pepper, worcestershire sauce, and mustard, until creamy.\nAdd bread crumbs, mixing evenly.\nAdd in the crab meat, being sure to mix evenly.\nShape into cakes.\nMakes 6 large or 9 medium crabcakes.\nSaute in pan with a little oil for about 5 minutes on each side.\nYou can also broil them until brown. This may require you to flip them, depending on your pan.\nServe with tartar sauce and lemon.\nTip: Try a crabcake sandwich. I use a Martin's Brand potato roll topped with tartar sauce and crisp lettuce.",
  "ingredients": ["1 lb lump crabmeat", "1⁄2 cup breadcrumbs", "2 eggs", "1⁄4 cup mayonnaise (do not use dressing)", "1 teaspoon Old Bay Seasoning", "1⁄4 teaspoon pepper", "2 tablespoons Worcestershire sauce", "1 teaspoon dry mustard"],
  "yields": "4 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/86/96/V3RrMXo4Rzqmp6TXq9iD_easy-crab-cakes-lemon-aioli-2971.jpg"
}, {
  "title": "Creme Brulee",
  "instructions": "Use 6-oz. ramekins.\nHeat the oven to 325°F.\nHeat the cream or cream and milk in a medium saucepan over medium heat until scalded (you'll see small bubbles on the sides of the pan).\nSplit the vanilla bean in half, if using, and scrape the seeds into the cream.\nMeanwhile, in a medium bowl, slowly whisk the sugar and salt into the egg yolks.\nSlowly temper the hot cream into the sugar/yolk mixture.\nStrain the mixture through a fine sieve into a pitcher or measuring cup.\nStir in vanilla extract if using.\nArrange the ramekins in a baking dish with deep sides, pour the mixture into the ramekins, Fill the baking dish with water to come halfway up the sides of the ramekins and cover the dish with foil.\nBake until just set, 25 to 50 min.\nRemember to start checking early; baking time will depend on the thickness and depth of your ramekins and baking dish.\nCarefully remove the baking dish from the oven and let the ramekins cool in the water bath.\nRemove, cover with plastic wrap and refrigerate at least 2 hours or up to 2 days.\nTopping: sprinkle a light layer of sugar over each cold creme brulee just before serving.\nCaramelize either using a propane torch by passing over the sugar or putting under a broiler.",
  "ingredients": ["1 quart heavy cream", "1⁄2 vanilla beans or 1 teaspoon vanilla extract", "1⁄2 cup sugar", "10 egg yolks", "1 pinch salt", "CARAMEL TOPPING", "1⁄2 cup sugar"],
  "yields": "8 serving(s)",
  "total_time": 65,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/54/68/1/pic72gE0B.jpg"
}, {
  "title": "Croque Madame",
  "instructions": "Spread butter on the two sides of the slices of bread.\r\nPut the slice of ham and cheese between the bread, making a sandwich.\r\nYou can either bake or grill the sandwich.\r\nTop the sandwich with a fried egg and enjoy!",
  "ingredients": ["2 slices bread", "1 slice ham", "1 slice swiss cheese", "1 egg, fried", "butter"],
  "yields": "1 serving(s)",
  "total_time": 7,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/17/02/94/lO3roXd9SWSUT8BOkMwS_croque-madame_3711.jpg"
}, {
  "title": "Cup Cakes",
  "instructions": "Cake:Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the cake and pudding mixes, sour cream, applesauce, oil, eggs, coffee/water, milk, and vanilla. Stir in the chocolate chips.\nFill pan: 2 round cake pans, 1 bunt pan, or 24 cup cakes. **For cup cakes, spray or use liners and fill each with one level ice cream scoop, it makes the perfect amount.\nBake for 50 to 55 minutes for cake or 20-25 min for cupcakes. It is done when the top is springy to the touch and a wooden toothpick inserted comes out clean, test twice because you might have hit a chocolate chip the first time. Cool cake thoroughly in pan at least an hour and a half before inverting onto a plate and frosting.\nFrosting:In small bowl with mixer at low speed (or by hand), combine marshmallow creme, peanut butter, butter, and vanilla until blended.\nIncrease speed to medium (or keep mixing by hand) and add confectioners' sugar and milk, adding just enough milk to make frosting smooth and spreadable.",
  "ingredients": ["Cake", "1 (18 1/4 ounce) package devil's food cake mix (any chocolate cake mix will do)", "1 (6 ounce) package instant chocolate pudding mix (I use sugar free)", "1 cup sour cream (low fat is fine)", "1 cup unsweetened applesauce", "1 tablespoon vegetable oil or 1 tablespoon canola oil", "4 eggs", "1⁄4 cup coffee, if you don't have coffee add water instead (instant or brewed)", "1⁄4 cup milk", "1 teaspoon vanilla (optional)", "1⁄2 - 1 cup semi-sweet chocolate chips (I like mini and it's optional)", "Frosting", "1 (7 ounce) jar marshmallow creme (1 cup)", "1⁄2 - 3⁄4 cup peanut butter (use more if you want more peanut butter taste)", "1⁄3 cup butter or 1/3 cup margarine, softened", "1⁄2 - 1 teaspoon vanilla extract", "1 1⁄2 cups confectioners' sugar", "1 -2 tablespoon milk"],
  "yields": "24 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/47/61/63/picHcoY7c.jpg"
}, {
  "title": "Deviled Eggs",
  "instructions": "Peel shells off cooled hard-boiled eggs; slice into halves lengthwise.\nRemove yolks from whites and place in a small round bowl.\nMash yolks with a fork into fine pieces.\nAdd 2 heaping tablespoons Mayonnaise, yellow mustard, diced gherkins and finely chopped jalapeno (seeds removed), and salt and black pepper to taste.\nStir mixture until creamy.\nSpoon mixture into a zip-lock sandwich bag; seal bag and snip off one corner of the bag.\nSqueeze mixture out of corner of bag into egg white halves.\nSprinkle tops of filled deviled eggs with paprika.\nChill in refrigerator 1 to 2 hours or until cold before serving.",
  "ingredients": ["6 large hard-boiled eggs", "salt and black pepper", "2 tablespoons real mayonnaise", "1 teaspoon prepared yellow mustard", "2 diced gherkins", "1 sliced jalapeno", "paprika"],
  "yields": "6 serving(s)",
  "total_time": 35,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/48/15/3/TrKIAiXyStaqjpJUCaT0_food.com-28.jpg"
}, {
  "title": "Donuts",
  "instructions": "In a large bowl mix the sugar, baking powder, salt and nutmeg.\nAdd eggs, milk and melted butter. Beat well.\nAdd 3 cups of the flour, beating until blended. Add one more cup of flour and beat well. The dough should be soft and sticky but firm enough to handle. If you feel its necessary, add up to 1/2 cup more flour.\nCover with plastic wrap and chill for *at* *least* one hour.\nRemove your dough from the fridge and begin heating about 1\" of oil to 360F in a large metal skillet.\nWorking half the dough at a time, roll it out on a floured surface to about 1/2\" thickness. Cut out circles using a doughnut cutter or large biscuit or cookie cutter. For the center, I actually use the cap off my martini shaker ;) to cut the holes.\nGently drop the doughnuts in batches into the hot oil. Flip them over as they puff and turn them a couple more times as they cook. They will take about 2-3 minutes in total and will be lovely and golden brown all over.\nRemove from the oil and set them on paper towels or brown paper bag (that removes all the fat, you know).\nDouse them with sugar and cinnamon, icing, chocolate dipped with sprinkles or whatever you like.",
  "ingredients": ["1 cup sugar", "4 teaspoons baking powder", "1 1⁄2 teaspoons salt", "1⁄2 teaspoon nutmeg", "2 eggs", "1⁄4 cup unsalted butter, melted", "1 cup milk", "4 cups flour (plus a little more if dough is sticky)", "oil (for frying)", "cinnamon sugar"],
  "yields": "",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/38/38/68/wmk3BwJSK2g1NYdTaczo_DSC_0163.jpg"
}, {
  "title": "Dumplings",
  "instructions": "Mix together in a bowl the flour, salt and baking powder.\nBring to just a simmer in a small saucepan the butter and milk.\nAdd the milk mixture to the dry ingredients.\nStir with a fork or kneed by hand 2 to 3 times until the mixture just comes together.\nDivide the dough into about 16 small puffy dumplings.\nRoll each piece of dough into a small rough ball.\nGently lay the formed dumplings on the surface of your stew or soup.\nCover and simmer for 10 minutes.\nServe immediately.",
  "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "1⁄2 teaspoon salt", "3 tablespoons butter", "1 cup milk"],
  "yields": "",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/30/96/5/fNGtry7Q12l9JZdHj3SD_DSC_0342.jpg"
}, {
  "title": "Edamame",
  "instructions": "If using fresh, strip all of the pods off of your soybean bunch and boil them whole in salted water for 5 minutes.\n(Start timing once the water returns to a boil) Drain the pods, liberally salt them, and then slip the seeds out of the pods directly into your mouth.\nHave a discard bowl handy for the shells.\nYou may never want to eat potato chips again!",
  "ingredients": ["edamame, as much as you would like to prepare (I use fresh, but frozen is easier to find and works well)", "salt"],
  "yields": "",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/40/29/0/picw3gijR.jpg"
}, {
  "title": "Eggs Benedict",
  "instructions": "Sauté the ham slices in the butter for 2 minutes.\nPlace the ham on English muffins.\nPoach the eggs in simmering water in a frying pan (a splash of white vinegar will help keep them together).\nWhen set remove with a slotted spoon and place on ham.\nWhirl eggs yolks, lemon juice and salt and pepper in blender on high for 30 seconds.\nUncover and continue to blend on high while slowly adding the melted butter in a thin slow stream.\nWhen the sauce is thick and creamy pour over eggs and serve.",
  "ingredients": ["6 slices ham", "1 1⁄2 tablespoons butter", "3 English muffins, split, toasted and buttered", "6 eggs", "hollandaise sauce", "4 egg yolks", "2 tablespoons lemon juice", "1⁄4 teaspoon salt", "1⁄8 teaspoon pepper", "1⁄2 cup hot melted butter"],
  "yields": "6 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/22/51/08/JIq6bFoQKKQRhUUakZNg_EB%204%20-%20final_2.png"
}, {
  "title": "Escargots",
  "instructions": "Preheat the oven to 350 degrees F.\nCombine the butter, parsley, shallots, garlic, and brandy in a bowl and blend well.\nPlace a snail in each shell and fill the cavity with the seasoned butter.  (If you do not have shells, you can use escargot baking dishes - this is actually how I prefer to make them.  Most of such dishes hold 6 escargot apiece.).\nPlace on a baking pan and bake for twelve minutes.\nServe hot, as an appetizer, on individual snail dishes - or on small folded napkins on plates, to keep the shells from sliding about.  Also, small silver forks to easily eat them with are a good idea.\nMake sure to have plenty of good bread alongside, to mop up the delicious butter sauce!  :).\nAlso good with a bit of Parmesan sprinkled on top of each.",
  "ingredients": ["1 cup butter, softened", "1⁄4 cup parsley, finely chopped", "2 shallots, minced well", "2 garlic cloves, minced well, to taste (I prefer extra garlic)", "2 tablespoons brandy", "32 canned French snails", "32 snail shells"],
  "yields": "8 serving(s)",
  "total_time": 22,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/73/73/picCgqnth.jpg"
}, {
  "title": "Falafel",
  "instructions": "To make Herbed Cucumber Yogurt: Add all yogurt ingredients to a mixing bowl; whisk to combine; cover and chill until ready to serve.\nTo make Falafel: Add the scallions, garlic, cilantro, and mint to the container of a food processor; pulse until mixture is finely chopped.\nAdd the chickpeas, breadcrumbs, cumin, baking powder, salt, and Tabasco; continue to pulse until the batter has the consistency of cooked oatmeal.\nLightly oil hands and form mixture into 4 burger shaped patties.\nSpray each patty lightly with cooking spray.\nLet the olive oil get hot (but not smoking) in a large skillet over medium heat.\nFry patties for about 4 minutes on each side or until golden brown and crisp.\nTransfer cooked patties to a paper-towel lined plate.\nPut cooked patty into warmed pita pocket with shredded lettuce, chopped tomatoes, and sliced onions.\nServe with Herbed Cucumber Yogurt.",
  "ingredients": ["4 scallions, cut into 1 inch pieces", "2 cloves garlic, halved", "1⁄2 cup coarsely chopped fresh cilantro", "1⁄4 cup coarsely chopped of fresh mint", "1 (15 ounce) can chickpeas, rinsed and drained", "1⁄2 cup plain dried breadcrumbs", "1 teaspoon ground cumin", "1 teaspoon baking powder", "1⁄2 teaspoon sea salt", "1 teaspoon Tabasco sauce", "vegetable oil cooking spray", "2 tablespoons olive oil", "4 pita pockets, warmed", "shredded lettuce", "chopped tomato", "sliced onion", "Herbed Cucumber Yogurt", "1 cup plain low-fat yogurt", "1 clove garlic, minced", "2 tablespoons fresh lemon juice", "1 kirby cucumber, seeded and chopped", "sea salt", "pepper"],
  "yields": "4 serving(s)",
  "total_time": 38,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/10/15/25/0nDDrWSYKdsqxAfpbd7w_falafel2.jpg"
}, {
  "title": "Filet Mignon",
  "instructions": "Clean and prepare filet.\nMix all marinade ingredients together.\nPlace in zip bag with tenderloin and let sit at room temperature for 30 minutes.\nCook to desired temperature (roast or grill).\nServe with demi-glace or brown gravy.\nCan top with sauteed mushrooms, if desired.",
  "ingredients": ["2 lbs beef tenderloin or 2 lbs steaks", "Marinade", "1⁄2 cup extra virgin olive oil", "1 tablespoon minced garlic", "1 tablespoon fresh basil, chopped", "1 tablespoon fresh parsley, chopped", "1 teaspoon blackening seasoning", "salt & pepper"],
  "yields": "6 serving(s)",
  "total_time": 45,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/39/88/0/pick9ozYq.jpg"
}, {
  "title": "Fish And Chips",
  "instructions": "Cut potatoes lengthwise into ½-inch strips.\nHeat oil (2 to 3 inches or enough to cover) in deep fryer or Dutch oven to 375 degrees.\nFill basket one-fourth full with potatoes.  (I don't have a basket - I use a Fry Daddy and it works fine. Just be sure and put the chips in one at a time so they don't stick to each\nother.) Skip the next step if you're not using a basket.\nSlowly lower basket into hot oil.  (If oil bubbles excessively, raise and lower basket several times.) Use a long-handled fork to keep potatoes separated.\nFry potatoes 5 to 7 minutes or until golden brown; drain on paper towels.\nPlace potatoes in single layer on cookie sheet and keep warm.\nRepeat with remaining potatoes.\nCut fish filets into 2 x 1/-1/2-inch pieces.  Pat dry with paper towels.\nMix flour and salt.\nMix baking soda and vinegar.\nStir vinegar mixture and water into flour mixture; beat until smooth.\nDip fish into batter, allowing excess batter to drip into bowl.\nFry 4 or 5 fish pieces at a time (do not use basket) about 3 minutes, turning fish once, until brown.  Drain on paper towels.\nSet oven control to broil.  Broil potatoes 6 inches from heat 2 to 3 minutes or until crisp.",
  "ingredients": ["4 potatoes", "corn or peanut oil", "1 lb cod or 1 lb other lean fish fillet", "2⁄3 cup all-purpose flour", "1⁄2 teaspoon salt", "1⁄2 teaspoon baking soda", "1 tablespoon vinegar", "2⁄3 cup water"],
  "yields": "4 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/86/21/0/picH7WnJB.jpg"
}, {
  "title": "Foie Gras",
  "instructions": "Prepare and open the liver at the ambient temperature on a plastic tablet with your hand.\nWith the peak of a sharp knife follow the blood vessels and through it away; The trick is to put the peak of your knife just under the vessel. No needs to pull it  strongly just open it delicately.\nOne the most important vessels are away, put salt, peppers and brandy on the liver.\nLet it marinate for 12 hours at least.\nThe day after, put your oven at around 150°C--it's important to follow carefully the temperature of the liver.\nPut it in a small size clay form (20 cm diameter max) with large boards, for 20 minutes; your oven should stay at a regular temperature for 30 minutes.\nLeave it for 3 hours in your freezer.\nCut in 1-inch slice. Put it on a roasted bread and enjoy it with a not dry white wine.",
  "ingredients": ["3⁄4 lb row fat duck liver", "1 glass cognac", "1 pinch salt", "3 pinches black pepper", "3 pinches red peppers"],
  "yields": "6 serving(s)",
  "total_time": 1460,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/gk-static/fdc-new/img/fdc-shareGraphic.png"
}, {
  "title": "French Fries",
  "instructions": "Preheat oven to 200 degrees.\nIn a large dutch oven heat oil to 320 degrees.\nPeel potatoes and EVENLY cut fries into 1/4\" x 1/4\" strips of equal length.\nPlace in a large bowl of cold water as you're slicing.\nDrain potatoes thoroughly, removing any excess water.\nWhen oil reaches 320 degrees, submerge the potatoes in the oil.\nWorking in small batches, fry for 2 to 3 minutes until they are pale and floppy.\nRemove from oil, drain, and cool to room temperature.\nIncrease the temperature of the oil to 375 degrees.\nRe-immerse fries and cook until crisp and golden brown, about 2 to 3 minutes.\nRemove and drain on roasting rack.\nSeason with kosher salt.\nOnce again this is done is small batches and will need to be kept warm in the oven until all potatoes are fried.",
  "ingredients": ["4 -5 large russet potatoes", "peanut oil", "salt"],
  "yields": "4 serving(s)",
  "total_time": 55,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/39/89/7/pic848yqP.jpg"
}, {
  "title": "French Onion Soup",
  "instructions": "In soup pot, cook onions, sugar, and pepper in oil until caramelized (about 15-20 minutes).\nStir often.\nAdd broth; bring to a boil.\nReduce heat; cover and simmer for 20 minutes.\nLadle into ovenproof bowls.\nTop each with bread and cheese.\nBroil until cheese is bubbly.",
  "ingredients": ["4 cups thinly sliced onions", "1⁄2 tablespoon sugar", "1⁄4 teaspoon pepper", "1⁄4 cup vegetable oil", "4 cups beef broth", "4 slices French bread, toasted", "1⁄2 cup shredded swiss cheese"],
  "yields": "4 serving(s)",
  "total_time": 43,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/33/75/2/picwPVis0.jpg"
}, {
  "title": "French Toast",
  "instructions": "Beat eggs with milk.\nStir in sugar, vanilla, orange juice, and salt until well combined.\nHeat about 2 tsp.of butter in a skillet on medium-high heat.\nDip bread in egg mixture and lay in butter.(not you-the bread!).\nReduce heat to medium and cook bread a few minutes on each side until golden brown.\n(My pan holds 2 pieces at a time.) Repeat with remaining bread, adding more butter to skillet, as needed.",
  "ingredients": ["8 slices homemade-type bread", "4 eggs", "1 cup milk", "2 tablespoons orange juice", "1 tablespoon sugar", "1⁄2 teaspoon vanilla extract", "1⁄4 teaspoon salt", "4 tablespoons butter"],
  "yields": "4 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/59/79/1/picerS6YR.jpg"
}, {
  "title": "Fried Calamari",
  "instructions": "First, coat the calamari rings in corn meal, shaking them out to get rid of any excess.\nThen dip them into a mixture of the eggs and garlic.\nLastly, dip them into the bread crumbs mixed with salt, coating them well, and shaking off any excess.\nUp to this point may be done in advance, and the calamari rings refrigerated for a couple of hours, until you are ready to fry.\nMeanwhile, heat the oil (the secret to crispy calamari is hot, hot oil, just below the smoking point.) Fry the rings (in batches) about 1 minute, or until they are golden.\nRemove and drain on paper towels.\nIf you have a deep fryer it's best, but otherwise, make sure the oil is deep enough to cover the calamari.\nServe immediately with lemon wedges, garlic mayo, and marinara sauce.",
  "ingredients": ["1 lb cleaned calamari, cut into rings", "1⁄4 cup cornmeal or 1/4 cup cornstarch", "2 eggs, slightly beaten", "2 cloves garlic, mashed", "1 cup breadcrumbs (I like garlic and parsley flavored)", "salt", "oil (for frying)"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/52/6/picMCLbXX.jpg"
}, {
  "title": "Fried Rice",
  "instructions": "Melt 1 tablespoon butter in skillet or wok.\nScramble eggs in butter, breaking up the cooked eggs into small pieces.\nSet aside.\nMelt 1 tablespoon butter in skillet or wok.\nSaute onions and/or green peppers in butter for 3 minutes.\nCombine eggs, onions, rice, and meat.\nStir in soy sauce until color of rice is uniform.\nStir in peas.\nHeat only until warm.",
  "ingredients": ["1 tablespoon butter or 1 tablespoon margarine", "2 eggs, beaten", "1 tablespoon butter or 1 tablespoon margarine", "1⁄4 cup chopped onion", "1⁄4 cup chopped green pepper (optional)", "2 cups rice, prepared and cooled", "1⁄2 1/2 cup cooked shrimp (optional) or 1/2 cup cooked chicken (optional)", "1⁄4 cup soy sauce", "1⁄2 cup cooked peas (optional)"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/85/94/22NCgGZSZesEPtXINoFw_Fried%20rice%208594-7.jpg"
}, {
  "title": "Frozen Yogurt",
  "instructions": "Blend all ingredients together until smooth.\nChill mixture (about 1-2 hours).\nPour chilled mixture into your ice cream machine and freeze according to manufacturer's instructions.",
  "ingredients": ["Regular Version", "1 cup pureed fruit (your choice)", "1 (8 ounce) container plain yogurt", "1⁄3 cup sugar (or to taste)", "Diet Version", "1 cup pureed fruit (your choice)", "1 (8 ounce) container plain nonfat yogurt", "6 envelopes Equal sugar substitute or 6 envelopes other no calorie powdered artificial sweetener"],
  "yields": "",
  "total_time": 5,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/30/44/0/piclgZzAj.jpg"
}, {
  "title": "Garlic Bread",
  "instructions": "Preheat oven to 375F degrees.\nCut slices down the length of bread loaf at 1 inch intervals, without cutting all the way through.\nRub slices and top of loaf with cut sides of garlic.\nMince garlic.\nCombine butter, garlic, parsley and Parmesan.\nSpread butter mixture between bread slices and on top of loaf.\nWrap bread in foil leaving top partially uncovered.\nBake until heated through, about 15 minutes.",
  "ingredients": ["1 loaf French bread, unsliced", "1⁄2 cup butter", "2 garlic cloves, halved", "1 teaspoon dried parsley", "1⁄3 cup grated parmesan cheese"],
  "yields": "4 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/12/59/8/pictpLdft.jpg"
}, {
  "title": "Gnocchi",
  "instructions": "Boil potato and mash.\nCombine potato with eggs and salt and whip until fluffy.\nAdd ricotta cheese, butter, Romano cheese and flour.\nKnead until smooth.\nShape into 1/2\" rolls and cut into 1\" lengths.\nMake impression with thumb in each piece, then lightly dust with flour.\nDrop into boiling salted water and cook only until they rise to the surface.\nDrain and serve with tomato sauce and grated cheese.\nNote: Before cooking, gnocchi may be flash frozen on a cookie sheet, then place in plastic bag in freezer.",
  "ingredients": ["1 large baking potato (1 c mashed)", "2 eggs", "1 teaspoon salt", "1 cup ricotta cheese", "8 teaspoons butter, clarified", "1 cup romano cheese, grated", "3 cups flour"],
  "yields": "8 serving(s)",
  "total_time": 35,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/53/87/4/ifIriOYpRLWRvqOb7ubQ_untitled-1364.jpg"
}, {
  "title": "Greek Salad",
  "instructions": "Whisk dressing ingredients together until blended.\nSeason to taste.\nDrain onion from ice water and pat dry with paper towels.\nCombine all salad ingredients, except cheese, in large bowl.\nToss with dressing.\nSprinkle cheese over and serve.",
  "ingredients": ["Dressing", "6 tablespoons olive oil", "1 1⁄2 tablespoons fresh lemon juice", "1 tablespoon red wine vinegar", "2 garlic cloves, minced", "1 teaspoon dried oregano (Mediterranean is best)", "Salad", "1 head lettuce, torn into bite-size pieces ((I use Romaine)", "3 large plum tomatoes, seeded and coarsely chopped", "1 English cucumber, peeled and coarsely chopped (the long, thin, almost seedless ones)", "1 medium red onion, cut into thin rings and soaked for 10 minutes in a small bowl of ice water to make it less sharp", "1 small green pepper, cut into thin rings", "3⁄4 cup kalamata olive", "3⁄4 cup crumbled feta cheese"],
  "yields": "6 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/90/97/5/xfirb0rQRMPAHtkSwTyA_THE%20FOOD%20GAYS%20-%20GREEK%20SALAD-2.jpg"
}, {
  "title": "Grilled Cheese Sandwich",
  "instructions": "Place cheese slices on 4 slices bread. Top with onions, tomato and remaining bread.\nSpread 1 t of the butter over each top slice of bread.\nPlace sandwiches, butter sides down, in skillet.\nSpread remaining butter over top slices of bread.\nCook uncovered over medium heat about 5 minutes or until bottoms are golden brown.\nTurn and cook 2 to 3 minutes or until bottoms are golden brown and cheese is melted.\nCut sandwiches into wedges or sticks, using pizza cutter.",
  "ingredients": ["1 slice cheddar cheese", "1 slice mozzarella cheese", "1 slice colby cheese or 1 slice monterey jack cheese", "8 8 slices white bread or 8 slices whole wheat bread", "2 tablespoons green onions, sliced", "3⁄4 cup tomatoes, seeded and chopped", "8 teaspoons butter or 8 teaspoons margarine, softened"],
  "yields": "4 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/19/40/54/picpajU8Y.jpg"
}, {
  "title": "Grilled Salmon",
  "instructions": "Mix all marinade ingredients and pour over salmon. Marinate for 1 hour. Place fillets over medium hot coals.\nGrill for 3 to 4 minutes on each side.",
  "ingredients": ["1 1⁄2 lbs salmon steaks or 1 1/2 lbs salmon fillets", "Marinade ingredients", "2 tablespoons lemon juice", "3 garlic cloves, minced", "1 teaspoon salt", "3 tablespoons olive oil", "1 teaspoon pepper", "3 teaspoons cajun seasoning"],
  "yields": "4 serving(s)",
  "total_time": 80,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/59/54/gahmNzSRqCw2B1aQgoX7_salmon1.jpg"
}, {
  "title": "Guacamole",
  "instructions": "Halve avocados; remove fruit by running spoon next to skin; discard seed or save for other uses.\nPlace avocado in bowl and mash with fork; immediately mix in lime juice, incorporating well.\nMix in remaining ingredients; serve immediately.",
  "ingredients": ["2 avocados", "1 lime, juice of", "2 medium tomatoes, chopped", "1 medium onion, chopped fine", "1⁄4 teaspoon pepper (or to taste)", "1⁄2 teaspoon salt (or to taste)", "2 garlic cloves, minced", "1⁄8 teaspoon ground cumin", "1⁄8 teaspoon cayenne pepper (or to taste)"],
  "yields": "",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/23/3/eq7q07fERkOFAGijqRqB_0S9A7116.jpg"
}, {
  "title": "Gyoza",
  "instructions": "Rinse cabbage leaves and onions, pat dry and mince finely.\nGrate ginger root and press or mince the garlic.\nCombine all with the ground pork, add the salt, pepper and soy sauce and mix well by hand.\nPlace 1 teaspoon of the mixture in the middle of each wrapper.\nDampen one edge of the wrapper, fold over and form the edge into accordian pleats.\nspread the dumplings out on a good-sized, lightly oiled pan and saute on medium until nicely browned.\nAdd enough water to cover just the bottom of the gyoza dumplings.\nCover pan and steam till the water cooks off.\nEat the dumpling whilst they are hot with Vinegar Soy sauce if you wish.\n*VinegarSoy Sauce; equal parts of soy sauce and rice wine vinegar, and a few drops of rayu (chinese style red chilli pepper oil).",
  "ingredients": ["24 gyoza skins", "1⁄4 lb ground pork", "4 cabbage leaves", "4 green onions", "1 clove garlic", "1 inch fresh gingerroot", "1 pinch salt", "1 pinch pepper", "1 dash soy sauce", "1 tablespoon soy sauce"],
  "yields": "",
  "total_time": 50,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/58/91/4/picp6unaY.jpg"
}, {
  "title": "Hamburger",
  "instructions": "Chop garlic cloves on wooden surface then put in mortar and pestle.\nAdd salt and olive oil and make a paste.\nAdd this to the meat along with the Worcestershire and horseradish.\nMix everything and adjust ingredients to suit your taste.\nWhen you make the patties place an indention in the middle of each one with your thumb (almost all the way through).  This keeps the burgers from shrinking.  We like ours thick and I like them to stay that way!\nSalt and Pepper according to taste when done.\nAn added note on 04-03-06 - Thank you all for your positive feedback.  It's nice to get confirmation on something I thought was good and different.\nPlease note that I usually add more ingredients than what is called for above.  I nuke a tiny hamburger (meatball size) and taste.  I usually add more of everything.  The horseradish does not taste like horseradish when cooked.  It gives it a flavor note that otherwise wouldn't be there.  Unless you are allergic to it, please try it.",
  "ingredients": ["1 lb good quality lean ground beef", "1 tablespoon olive oil", "2 garlic cloves", "1⁄4 teaspoon salt", "2 -3 tablespoons Worcestershire sauce", "1 tablespoon horseradish (optional but good) (optional)"],
  "yields": "4 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/10/42/8/or7l9WxFSt7AAiyEsv73_HB%205%20-%20final_3.jpg"
}, {
  "title": "Hot And Sour Soup",
  "instructions": "In separate bowls, cover the lily buds and tree ear mushrooms with hot water; let soak until softened, about 30 minutes; drain and thoroughly rinse the lily buds and mushrooms; trim the tough ends from the buds and halve them crosswise.\nIn a large pot, combine the broth, lily buds, mushrooms, bamboo shoots, ginger and salt; cover and bring to a boil over medium-high heat; reduce the heat and simmer for 10 minutes; stir in the vinegar and 1 tsp red pepper and boil over medium-high heat for 2 minutes; beat the cornstarch mixture into the soup in a steady stream; in a bowl, combine the egg and egg white and beat into the soup; stir in the soy sauce, tofu and sesame oil and cook over medium heat until warmed through; season with red pepper and garnish with spring onion.",
  "ingredients": ["40 dried lily buds", "1⁄4 cup small tree ear dried mushroom", "5 cups vegetable broth", "1⁄2 cup drained canned bamboo shoot, rinsed and julienned", "2 teaspoons fresh ginger, minced", "1⁄4 teaspoon salt", "3 tablespoons red wine vinegar, to taste", "crushed red pepper flakes", "3 tablespoons cornstarch, mixed with", "3 tablespoons water", "1 large egg", "1 large egg white", "2 1⁄2 tablespoons black soy sauce or 3 tablespoons light soy sauce, plus a pinch of sugar", "4 ounces firm tofu, cut into 1/3 inch dice", "1 teaspoon sesame oil", "1 spring onion, finely sliced"],
  "yields": "4 serving(s)",
  "total_time": 33,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/10/24/09/picaRNwV2.jpg"
}, {
  "title": "Hot Dog",
  "instructions": "Simmer frankfurters in beer or water for approximately 10 minutes.\nWarm buns in microwave, until slightly warm and soft.\nTo assemble hot dogs, place frank in each bun.\nAdd mustard to taste; top with dill spear, relish, onion, tomato, and 1-2 sport peppers (Jalapenos\"might\" be a reasonable substitute if you are desperate to find the sport peppers, but the taste won't be quite the same).\nSprinkle with celery and poppy seeds.\nServe.",
  "ingredients": ["4 natural casing beef frankfurters (I like Boar's Head brand)", "4 hot dog buns (with poppyseeds if you can find them)", "1 small onion, diced fine", "3 -4 teaspoons sweet pickle relish (bright green type if you can find it!)", "1 cold-pack kosher dill pickle, quartered lengthwise", "1 small tomatoes, sliced into julienne strips", "4 -8 pickled sport bell peppers or 4 -8 tiny hot peppers (Kroger sells these)", "dusseldorf-style brown mustard, with horseradish,to taste (may use yellow mustard)", "celery seed", "poppy seed (omit if using seeded buns)", "beer, for simmering (standard golden lager preferred; not authentic) (optional)"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/25/97/2/aggfMmsTsWsZtgYGG9vd_CSHD%203%20-%20final%201%20copy.jpg"
}, {
  "title": "Huevos Rancheros",
  "instructions": "In large skillet, heat olive oil.\nAdd onion and green pepper, cook until tender.\nAdd tomato, garlic, jalapeno, if using, oregano, salt, hot pepper sauce, tomato sauce and water.\nSimmer, covered for 20 minutes.\nUncover.\nBreak eggs, one at a time, into cup and slip into sauce.\nCover and simmer over low heat until eggs are set, about 5 minutes.\nServe over tortillas or toasted English muffins, topped with some of the sauce.\nEnjoy!",
  "ingredients": ["2 tablespoons olive oil", "1⁄2 cup chopped onion", "1 green pepper, chopped", "1 tomatoes, peeled and chopped", "1 clove garlic, minced", "1 jalapeno pepper, chopped (optional)", "1 teaspoon dried oregano leaves", "1⁄2 teaspoon salt", "1 teaspoon hot pepper sauce (Tabasco is good)", "1 (8 ounce) can tomato sauce", "1⁄2 cup water", "6 eggs"],
  "yields": "6 serving(s)",
  "total_time": 45,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/53/04/1/e6P4aAzGSHC8OqiPKnUZ_HR%207%20-%20final_5.jpg"
}, {
  "title": "Hummus",
  "instructions": "Drain beans and reserve the liquid when you do so.\nBlend beans, along with the other ingredients and 1/4 cup of the liquid.\nProcess until the mixture is smooth.\nAdd liquid until the desired consistency is reached.\nAdjust seasonings alongwith more cumin, lemon juice, salt and pepper.",
  "ingredients": ["2 (15 ounce) cans garbanzo beans", "1⁄2 cup tahini (sesame seed paste)", "6 tablespoons lemon juice", "3 garlic cloves, pressed", "1 teaspoon ground cumin", "salt and pepper"],
  "yields": "12 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/42/4/TZrzYUnEQCuzldugUJ31_hummus-7458.jpg"
}, {
  "title": "Ice Cream",
  "instructions": "Put first 3 ingredients in the smaller Ziplock bag and seal bag (Make sure it is tightly closed!). Put ice and rock salt in the larger bag and then add the filled small bag. Seal the large bag.\nSqueeze bag until ice cream is thickened, about 10-15 minutes.\nRemove small bag, unseal, and eat with spoon.\nNo need to even dirty a bowl!",
  "ingredients": ["1⁄2 cup half-and-half", "1 tablespoon sugar", "1⁄4 teaspoon vanilla", "1 sandwich ziploc bag", "1 gallon ziploc bag", "3 cups crushed ice", "1⁄3 cup rock salt"],
  "yields": "1 serving(s)",
  "total_time": 17,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/25/7/2JJoFSfLThmN7HGdi0na-Homemade-Ice-Cream-In-A-Bag---34257-4.JPG"
}, {
  "title": "Lasagna",
  "instructions": "Brown ground meat, onion and garlic.\nAdd salt, pepper, parsley, oregano, basil, chopped tomatoes with juice, tomato paste; stirring until well mixed.\nCover and simmer 1 hour (or longer,but watch for getting too dry).\nCook lasagna noodles according to package directions; drain and set aside.\nSpray a 13 x 9\" baking pan with cooking spray.\nCombine riccota cheese, eggs, pepper, 2 tablespoons parsley, Parmesan cheese and 1/2 1lb of mozzarella cheese; In a lasagna pan, layer noodles, meat sauce, and cheese mixture; repeat.\nTop off with layer of noodles; sprinkle evenly with remaining mozzarella cheese; make sure to cover noodles completely.\nBake at 375F for 40-60  minutes, or until cheese mixture is thoroughly melted. (I cover w/ foil for about 40 minutes, then uncover for 15-20 minutes.\nLet sit for 15-20 minutes before cutting and serving.",
  "ingredients": ["1 1⁄2 lbs lean ground beef", "1⁄2 lb Italian sausage or 1/2 lb ground veal", "1 large onion, chopped", "2 -3 garlic cloves, minced", "1 teaspoon salt", "1 teaspoon fresh coarse ground black pepper", "1 tablespoon dried parsley flakes", "1 tablespoon dried oregano", "1 tablespoon dried basil", "2 (14 1/2 ounce) cans whole tomatoes, undrained and chopped (or canned chopped tomatoes)", "12 ounces tomato paste", "24 ounces ricotta cheese", "2 eggs, beaten", "1⁄2 teaspoon pepper", "2 tablespoons parsley", "1⁄2 cup grated parmesan cheese", "1 lb mozzarella cheese, divided", "12 -15 lasagna noodles"],
  "yields": "12 serving(s)",
  "total_time": 150,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/28/76/8/SyAcnUdwTHGQfekagLBj_ABEL%203%20-%20final_1.png"
}, {
  "title": "Lobster Bisque",
  "instructions": "In a saute pan heat a little oil over med-high heat and saute shallots, onions, and garlic for one minute.\r\nDeglaze the pan with the white wine.\r\nAdd the worcestershire, tabasco, and thyme and saute for another minute.\r\nDeglaze the pan with the sherry.\r\nAdd the paprika, hot water and lobster base and combine well.\r\nStir in tomato paste and add the bay leaves.\r\nSimmer for 10 minutes.\r\nWhisk in heavy cream and the butter and bring to a boil. \r\nAdd the lobster and simmer until cooked through.\r\nServe with crusty garlic bread.",
  "ingredients": ["1⁄2 lb lobster meat, cut into small chunks", "2 tablespoons minced shallots", "2 tablespoons chopped green onions", "3 garlic cloves, crushed", "1⁄4 cup white wine", "2 teaspoons Worcestershire sauce", "2 teaspoons Tabasco sauce", "1 teaspoon dried thyme", "6 tablespoons dry sherry", "1 teaspoon paprika", "1 cup hot water", "1 teaspoon lobster base (better than boulion)", "4 ounces tomato paste", "2 bay leaves", "2 cups heavy whipping cream", "4 tablespoons butter"],
  "yields": "3 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/17/93/84/picIHL5Fh.jpg"
}, {
  "title": "Lobster Roll Sandwich",
  "instructions": "Combine first five ingredients in a mixing bowl;  mix well.\nLine the roll with lettuce.\nStuff the lobster salad into the hot dog rolls.",
  "ingredients": ["1⁄2 cup mayonnaise", "2 teaspoons Dijon mustard", "1⁄3 cup celery, diced", "1 tablespoon fresh lemon juice", "1⁄4 teaspoon Old Bay Seasoning", "3 cups lobster meat, cooked and cut into bite sized chunks", "6 lettuce leaves", "6 hot dog rolls"],
  "yields": "6 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/37/24/66/picwKkJ6M.jpg"
}, {
  "title": "Macaroni And Cheese",
  "instructions": "Preheat oven to 350 degrees.\nIn a pan cook butter, salt, pepper and flour and stir until smooth.\nRemove from heat add milk, return to heat and bring to a boil.\nBoil 1 minute.\nRemove from heat and add cheese, stir until melted.\nPour over elbows, sprinkle with breadcrumbs and bake at 350 degrees for 30 minutes.",
  "ingredients": ["16 ounces elbow macaroni (cooked)", "1⁄2 cup butter", "1 teaspoon salt", "1⁄2 teaspoon pepper", "1⁄2 cup flour", "3 1⁄2 cups milk", "1 lb cheese, cut into cubes (I use Velveeta for creamier mac and cheese)", "breadcrumbs"],
  "yields": "6 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/52/79/9/VgaiZqtbRByPpcH71R9E_Macaroni%20and%20cheese%2052799-7.jpg"
}, {
  "title": "Macarons",
  "instructions": "Combine almond flour and icing sugar in a food processor. Pulse for 30 seconds until light, airy and fine.\nSift the icing sugar and almond powder mixture into a large mixing bowl and set aside.\nIn a small saucepan, combine sugar and water. Stir until all the sugar is moistened. Try not to get any sugar up the sides of the saucepan as this will burn.\nFit the saucepan with a candy thermometer and set over medium-high heat. Bring to a boil and cook until the thermometer reaches 238&deg;F DO NOT STIR.\nImmediately after turning on the heat under the sugar, add egg whites to the bowl of a stand mixer, fitted with a whisk attachment and start to whip on medium speed.\nOnce the egg whites are foamy, add the lemon juice and continue to beat until soft, rounded peaks form.\nWhen the sugar syrup is ready, pour into the whipping egg whites by gently tipping the saucepan into the space between the whisk and the side of the bowl, using the side of the bowl as a guide. You want a slow, steady stream of syrup to pour into the egg whites. You can pour the sugar directly down the inner side of the bowl, using the lip of the bowl as a rest, if it is easier on your wrists.\nOnce all the sugar is incorporated into the egg whites, turn the mixer up and whip the egg whites until stiff peaks form and the bowl of the mixer is no longer warm.\nIf you wish to add food colouring, add it now to the egg whites. The food colouring must be in powder or gel form, do not use liquids.\nUsing a rubber spatula, scrape half of the egg whites out and fold into the almond flour mixture until fully combined.\nFold in the remaining egg whites into the almond mixture and mix well.\nNow it is time to stir. This step is called \"Macaronnée\", which is basically slapping the mixture against the side of the bowl using the spatula to thin the mixture. It is ready when a scoop of the mixture falls from the spatula in a continuous ribbon and disappears back into the batter in the bowl in about 15 seconds. *This is part that will usually make or break the cookies.\nFit a large piping bag with a round tip and spoon the mixture into the bag.\nUse a baking sheet fit with a silicone baking mat (best results) or a piece of parchment paper cut to size.\nPipe equal rounds of batter about 1.5\" apart. Use steady pressure when pushing the batter out of the bag to ensure equal rounds. I also count to three, then I move on the the next and repeat. That's my little trick. Pipe straight up and down so the rounds are perfect. the piped macarons should look like flattened Hershey's kisses.\nGently tap the bottom of the pastry sheets to smooth the macarons tops. *This will smooth out the \"nipples\" as I call them. The little points from where the piping bag was pulled up.\nLet the macarons sit for 1 to 2 hours until the tops are dry to the touch and matte. The time will differ based on multiple variables so don't worry if it takes less or more time.\nPreheat oven to 275&deg;F.\nWhen macarons are dry, bake them in the middle of the oven for 20 minutes. *They should have a smooth, rounded shell-like top and a \"foot\" which looks like a thin cloud.\nLet the macarons cool completely before removing them from the trays. They should have a smooth, rounded shell-like top and a \"foot\" which looks like a thin cloud.\nOnce the macarons are cool, you can package them and freeze them, or fill them with your desired flavoured buttercream, chocolate or fruit filling.",
  "ingredients": ["1 1⁄2 cups almond flour", "1 cup icing sugar", "3 large egg whites", "2 drops lemon juice", "1⁄2 cup granulated sugar", "3 tablespoons water"],
  "yields": "",
  "total_time": 35,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/53/50/62/RevSFbWmRCKsVE3kBIcP_IMG_0329%5B3801%5D.JPG"
}, {
  "title": "Miso Soup",
  "instructions": "Bring water to a boil; add dashinomoto and miso, stir until miso is dissolved. Add any extras if desired. Garnish with chopped green onions.",
  "ingredients": ["5 -6 cups water", "1 teaspoon instant dashi stock", "1⁄2 cup miso", "3 green onions, chopped"],
  "yields": "6 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/29/90/07/picKwU4YD.jpg"
}, {
  "title": "Mussels",
  "instructions": "When you bring your mussels home from the market, discard any that are chipped, broken or otherwise damaged; discard any mussel that is open.\nIf you are not using right away, cover with damp paper towels in a container that can be tightly closed and store in the refrigerator.\nJust before cooking, wash the mussels in several changes of cold water.\nUsing a small knife or a dry towel, remove the beards by pulling out towards the hinged side of the mussel.\nTo remove any remaining sand, soak mussels for about 30 minutes in cold water containing a handful of salt and a handful of flour.\nTake each mussel from the bowl and using a firm brush, remove any barnacles before placing into another bowl of clear water.\nMelt butter in a medium sized pot; saute onions til clear.\nAdd garlic& stir for another minute.\nAdd tomato, oregano, salt& pepper and cook until tomato is soft.\nAdd wine& bring to a slow boil.\nDry the mussels with a clean towel, place into pot, cover & steam for 4 minutes; remove the lid & stir the mussels.\nAt this point, most of the mussels should be open; replace the lid and steam for another 2 - 4 minutes.\nDiscard any that don't open.\nDivide into serving bowls& cover with broth.\nIf you increase the serving size for this recipe, don't add too many mussels to the pot at once or stack them on top of each other as it will make it difficult for the mussels to open due to the weight.",
  "ingredients": ["1 1⁄4 lbs mussels", "2 tablespoons butter", "1 1⁄2 tablespoons onions, minced", "1 garlic clove, minced", "1 small tomatoes, chopped", "1⁄4 teaspoon oregano", "salt & freshly ground black pepper (to taste)", "1⁄4 cup dry white wine"],
  "yields": "2 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/57/54/2/picz8WCpB.jpg"
}, {
  "title": "Nachos",
  "instructions": "Preheat oven to 400°F\nSpread chips on an oven proof plate, top with sausage and cheese.\nBake until cheese melts, about 10 minutes.\nTop with remaining ingredients.",
  "ingredients": ["5 ounces corn tortilla chips", "2 cups cheddar cheese, shredded", "8 ounces sausage, cooked and crumbled", "2 jalapenos, finely chopped", "2 ounces sour cream", "1 tomatoes, finely chopped", "1 avocado, finely chopped"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/14/15/40/iM84S3OrShydjmglGiUv_UN%205%20final%20-%20nachos%20(1%20of%201).jpg"
}, {
  "title": "Omelette",
  "instructions": "Crack the eggs into a small bowl and whisk.\nAdd some salt and pepper, if you like, but do not add any water, milk, or any other liquids.\nHeat the oil or butter in a 9-inch non-stick frying pan and pour in the eggs.\nIn the first 30-seconds of cooking, use a spatula to create 6-10 small cuts through the omelette.\nThis allows the uncooked egg on the top to flow down to the bottom of the pan.\nWhen the top is nearly set, sprinkle any fillings over half of the omelette and turn off the heat.\nDon't worry if some of the egg in the very centre isn't quite set, because the ambient heat will soon cook it.\nUse your spatula to flip one half of the omelette over the other and serve immediately.",
  "ingredients": ["2 large eggs", "salt and pepper, to taste", "1 tablespoon oil or 1 tablespoon butter, for frying"],
  "yields": "1 serving(s)",
  "total_time": 4,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/82/53/8/RkND79iJRAytDrkaoSdE_easy-omelette-3784.jpg"
}, {
  "title": "Onion Rings",
  "instructions": "Cut onions into 1/2-inch slices, and separate into rings.\nSet aside.\nWhisk together flour and next 4 ingredients until smooth.\nPour oil to a depth of 2 inches into a Dutch oven; heat to 375°.\nDip onion rings in batter, coating well.\nFry, a few rings at a time, until golden.\nDrain on paper towels.\nServe immediately.",
  "ingredients": ["2 large onions", "1 cup all-purpose flour", "2 cups buttermilk", "1 tablespoon sugar", "1 teaspoon baking powder", "1⁄2 teaspoon salt", "peanut oil"],
  "yields": "4 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/51/73/6/picf9HMLu.jpg"
}, {
  "title": "Oysters",
  "instructions": "Split the tough skin-like muscle that surrounds each \"oyster\" (use a sharp knife). You can also remove the skin easily if the meat is frozen and then peeled while thawing.\nSoak in a pan of salt water one hour; drain.\nTransfer to a large pot and add enough water to float the meat.\nAdd the vinegar to the pot.\nParboil, drain and rinse.\nLet cool and slice each oyster into 1/4 inch thick ovals.\nSprinkle salt and pepper on both sides of sliced oyster to taste.\nCombine flour, cornmeal and some garlic powder to taste.\nRoll each slice into flour mixture.\nDip into milk.\nRoll again into flour mixture.\nDip into wine.\n(repeat the procedure for a thicker crust).\nFry in hot oil or fat seasoned with the bottled hot sauce to taste (be careful, it will sizzle when you add the hot sauce); fry until golden brown.\nDrain on paper towels.\nServe with cocktail sauce if desired.",
  "ingredients": ["2 lbs bull testicles (calf, lamb, sheep, or turkey testicles can also be used)", "2 tablespoons salt", "1 tablespoon vinegar", "1 cup flour", "1⁄4 cup cornmeal", "1 cup red wine", "salt", "pepper", "garlic powder", "bottled hot sauce", "cooking oil (for frying) or fat (for frying)"],
  "yields": "6 serving(s)",
  "total_time": 110,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/28/38/6/picnmMAfp.jpg"
}, {
  "title": "Pad Thai",
  "instructions": "Cook noodles in boiling water for 1-2 minutes or until softened, stirring constantly; drain and plunge into cold water; drain again.\nStir-fry onion and garlic in wok until tender; add pork, shrimp, lemongrass, and chilies, cooking 5 minutes further, or until pork is done.\nAdd sugar, fish sauce, lime juice, ketchup, black pepper, eggs, noodles, bean sprouts and chives; cook, stirring well for 2-4 minutes, until egg is pretty much cooked and set.\nServe on plates sprinkled with cilantro and peanuts; and optional hot sauces such as Nam Prik Dang or Sambal Oelek (chile paste) as table condiments, if desired.",
  "ingredients": ["1 (16 ounce) package rice noodles", "2 tablespoons vegetable oil", "3 teaspoons minced garlic", "1 cup chopped onion", "1 stalk lemongrass, flattened with cleaver and finely chopped", "1 1⁄2 lbs boneless pork loin, julienned", "1⁄2 cup dried shrimp, soaked in 1/2 cup water for 5 minutes (or 1/2 cup salad shrimp plus salt to taste)", "6 Thai red chili peppers, minced", "1 tablespoon sugar", "3 tablespoons fish sauce", "3 tablespoons fresh lime juice", "4 tablespoons ketchup", "3⁄4 teaspoon black pepper", "2 eggs, lightly beaten", "6 cups bean sprouts", "1⁄4 cup chinese chives, chopped (or 1/4 cup chopped green onion plus minced garlic to taste)", "1⁄4 cup chopped fresh cilantro", "1⁄3 cup chopped peanuts"],
  "yields": "6 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/30/11/1/picfkrjyq.jpg"
}, {
  "title": "Paella",
  "instructions": "Preheat oven to 400 degrees.\nSprinkle chicken with rosemary, 1/2 teaspoon salt, and black pepper.\nHeat oil in a large oven proof nonstick skillet or paella pan over medium-high heat.\nAdd chicken; cook for 3 minutes on each side or until lightly browned.\nRemove chicken from pan; cover and keep warm.\nAdd chourice and cook until lightly browned;.\nAdd onion and bell pepper; cook for 7 minutes, stirring constantly.\nAdd rice, tomato, paprika, saffron and garlic; cook for 1 minute stirring constantly.\nReturn chicken to pan.\nAdd broth and 1/4 teaspoon of salt; bring to boil.\nWrap handle of pan with foil, cover pan;.\nBake at 400°F for 10 minutes.\nStir in shrimp, asparagus, and peas.\nCover and bake an additional 5 minutes or until shrimp are no longer translucent.",
  "ingredients": ["6 skinless chicken thighs (about 1 1/2 lbs.)", "1 teaspoon chopped fresh rosemary or 1/4 teaspoon dried rosemary", "3⁄4 teaspoon salt, divided", "1⁄4 teaspoon fresh ground black pepper", "2 teaspoons canola oil", "1 link Portuguese chourico, sliced in rounds", "1 cup onion, chopped", "1⁄2 cup red bell pepper, chopped", "1 1⁄2 cups uncooked arborio rice or 1 1/2 cups other medium grain rice", "1⁄2 cup diced plum tomato", "1 teaspoon sweet paprika", "1⁄4 teaspoon saffron thread, crushed", "1 garlic clove, minced", "3 cups chicken broth", "3⁄4 lb large shrimp, peeled and deveined", "1 cup asparagus, cut diagonally", "1⁄2 cup frozen peas, thawed"],
  "yields": "6 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/22/62/18/pico8z8bt.jpg"
}, {
  "title": "Pancakes",
  "instructions": "Beat egg until fluffy.\nAdd milk and melted margarine.\nAdd dry ingredients and mix well.\nHeat a heavy griddle or fry pan which is greased with a little butter on a paper towel.\nThe pan is hot enough when a drop of water breaks into several smaller balls which 'dance' around the pan.\nPour a small amount of batter (approx 1/4 cup) into pan and tip to spread out or spread with spoon.\nWhen bubbles appear on surface and begin to break, turn over and cook the other side.",
  "ingredients": ["1 egg", "3⁄4 cup milk", "2 tablespoons butter or 2 tablespoons margarine, melted", "1 cup flour", "1 tablespoon sugar (or 1/2 teaspoon honey or molasses)", "1 teaspoon baking powder", "1⁄2 teaspoon salt"],
  "yields": "",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/25/69/0/picwslJ1c.jpg"
}, {
  "title": "Panna Cotta",
  "instructions": "In a medium saucepan sprinkle the contents of the gelatin packet over the half and half and let stand for 5 minutes.\nOver low heat stir the gelatin mixture until it totally dissolves.\nAdd the heavy cream.\nAdd half of the vanilla and sugar.\nStir again over the low heat until the sugar is dissolved.\nTaste and add remaining vanilla if you wish.\nWipe the insides of 4-1/2 cup ramekins with a light coating of canola oil.\nLadle in the cream mixture and let stand until cool.\nPlace in the fridge for 4 hours.\nYou can serve in the dishes or invert.\nServe with fresh fruit.",
  "ingredients": ["1⁄2 cup half-and-half", "1 (1/4 ounce) envelope unflavored gelatin", "2 cups heavy cream", "2 teaspoons pure vanilla extract", "6 tablespoons white sugar"],
  "yields": "4 serving(s)",
  "total_time": 6,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/96/2/5WKgAhX4SyWQETHhwmlA_panna-cotta-3.jpg"
}, {
  "title": "Peking Duck",
  "instructions": "Wash& dry the duck inside and out.\nRub salt into the cavity.\nPut Duck on a large plate spoon the vodka over the duck& rub all over, turn the duck and make sure you rub the vodka all over the bird Leave it for 4 hours.\nDissolve the honey in the water and rub all over the duck.\nDo not miss any area Truss the bird and tie a cord around it's neck and hang it in front of an electric fan Leave it to dry for at least 4 hours.\nPreheat oven to 375f.\nPlace the ginger inside the duck.\nPlace duck on a rack in a pan with water in it.\nThe duck must be well above the water.\nCook for 30 minutes then turn heat down to 300F degrees and continue roasting for about 1 hour.\nTurn heat up to 375f and continue roasting until skin is crisp and brown all over.",
  "ingredients": ["1 (5 lb) duck", "2 teaspoons salt", "1⁄3 cup vodka", "3 tablespoons honey", "3 cups water", "6 slices fresh ginger", "For serving", "Mandarin pancake", "green onion, ends sliced to make a brush", "hoisin sauce", "1 cucumber, peeled and cut in slivers"],
  "yields": "6 serving(s)",
  "total_time": 570,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/13/44/3/01487446821.jpeg"
}, {
  "title": "Pho",
  "instructions": "To make the broth, heat a large pot over medium-high heat. Add the onion, shallots, garlic, ginger, cinnamon sticks, star anise, and cloves and dry-roast, stirring occasionally, until the vegetables begin to char. Add the stock and soy sauce and bring to a boil over high heat. Turn the heat down to medium-low, cover, and simmer for about 25 minutes. Strain into a clean pot and discard the solids. Taste the broth and add salt if necessary. Keep warm over low heat.\nWhile the broth is simmering, prepare the rice noodles. Place the noodles in a large bowl. Pour boiling water over the noodles to cover and soak for 20 minutes.\nWhen you are ready to assemble the soup, add the seitan or tofu to the warm broth and allow to heat through. Drain the soaked rice noodles and divide evenly among 4 to 6 large bowls. Using a slotted spoon, scoop the seitan or tofu out of the broth and distribute among the bowls. Ladle the hot broth over the noodles. Serve the bowls of pho with the scallions, bean sprouts, herbs, lime wedges, hoisin sauce and chili sauce on a seperate platter so that everyone can season their own soup as they wish.",
  "ingredients": ["for the broth", "1 small unpeeled onion, quartered", "2 unpeeled shallots, halved", "8 garlic cloves, halved", "ginger, coarsely sliced", "2 (3 inch) cinnamon sticks", "2 star anise pods", "4 cloves", "8 cups clear vegetable stock", "3 tablespoons soy sauce", "salt (to taste)", "for the soup", "1 lb rice noodles", "8 ounces seitan or 8 ounces fried tofu, sliced", "6 scallions, thinly sliced (both green and white parts)", "1 1⁄2 cups bean sprouts (approx)", "mint (a big handful, to taste) or cilantro leaf, left whole (a big handful, to taste)", "1 lime, cut into wedges (for serving)", "hoisin sauce (to taste)", "sriracha chili paste (to taste)"],
  "yields": "6 serving(s)",
  "total_time": 600,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/23/87/65/jHoU11vOSR6SKF2uwWaW_vegetarian%20PHO.JPG"
}, {
  "title": "Pizza",
  "instructions": "Mix a little sugar into the warm water.\nSprinkle yeast on top.\nWait for 10 minutes or until it gets all foamy.\nPour into a large bowl.\nAdd flour, salt, olive oil.\nCombine.\nKnead for 6-8 minutes until you have a moderately stiff dough that is smooth and elastic (add a bit more flour if you need to).\nCover and let rest for 20-30 minutes.\nLightly grease two 12-inch pizza pans.\nSprinkle with a little bit of cornmeal.\nDivide dough in half.\nPlace each half on a pizza pan and pat it with your fingers until it stretches over the whole pan.\nTry to make it thicker around the edge.\nIf desired, pre-bake at 425 F for 10 minutes (I don't always do this).\nThen spread with pizza sauce and use the toppings of your choice.\nBake at 425 F for 10-20 minutes longer or until bubbly and hot.\nMakes 2 12-inch pizzas.\nIf you don't want to use all the dough, you can freeze it.\nTake a portion of dough, form into a ball, rub olive oil over it and place it in a freezer bag (the oil makes it easier to take out of the bag).\nWhen you want to make a pizza, take dough out of freezer and allow to thaw before using.",
  "ingredients": ["2 1⁄2 cups all-purpose flour (may substitute whole wheat flour for 1 cup of the all-purpose)", "1 (1/4 ounce) package active dry yeast", "1⁄4 teaspoon salt", "1 cup warm water", "1⁄2 - 1 tablespoon olive oil", "cornmeal, for sprinkling"],
  "yields": "",
  "total_time": 75,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/70/16/5/VpYCAyQQw2c3LFvutQsZ_Final%201%20-%20Heart%20Shaped%20Pizza.jpg"
}, {
  "title": "Pork Chop",
  "instructions": "Preheat oven to 350.\nRinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste.\nPlace the beaten eggs in a small bowl.\nDredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.\nHeat the oil in a medium skillet over medium-high heat.\nFry the pork chops 5 minutes per side, or until the breading appears well browned.\nTransfer the chops to a 9 x 13 baking dish, and cover with foil.\nBake in the preheated oven for 1 hour.\nWhile baking, combine the cream of mushroom soup, milk and white wine in a medium bowl.\nAfter the pork chops have baked for an hour, cover them with the soup mixture.\nReplace foil, and bake for another 30 minutes.",
  "ingredients": ["6 pork chops", "1 teaspoon garlic powder", "1 teaspoon seasoning salt", "2 eggs, beaten", "1⁄4 cup all-purpose flour", "2 cups Italian style breadcrumbs", "4 tablespoons olive oil", "1 (10 3/4 ounce) can condensed cream of mushroom soup", "1⁄2 cup milk", "1⁄3 cup white wine"],
  "yields": "6 serving(s)",
  "total_time": 150,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/34/49/9/ghJ53URWS2oYSG25Y1KA_awesome-baked-pork-chops-5351.jpg"
}, {
  "title": "Poutine",
  "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C).\nWarm gravy in saucepan or microwave.\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes.\nRemove to a paper towel lined plate to drain.\nPlace the fries on a serving platter, and sprinkle the cheese over them.\nLadle gravy over the fries and cheese, and serve immediately.",
  "ingredients": ["1 quart vegetable oil (for frying)", "1 (10 1/4 ounce) can beef gravy", "5 medium potatoes, cut into fries", "2 cups cheese curds"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/33/88/picvJyEQF.jpg"
}, {
  "title": "Prime Rib",
  "instructions": "Let the prime rib roast stand at room temperature for about an hour.\r\nMix the salt, pepper, white pepper, garlic powder and crushed thyme together in a small bowl.\r\nPoke holes in the roast at 1 inches intervals with a fork.\r\nRub top and sides of roast with the 2 T. of Worcestershire sauce.\r\nRub the powdered seasonings all over the top and sides of roast.\r\nPlace fat side up in pan.  Don't cover and don't add water/liquid.\r\nPreheat oven to 500 degrees then turn down to 350 when you put the roast in (this will sear the outside).\r\nThe actual roasting time will depend on the size roast that you have.\r\nRoast for 18-22 minutes per pound for medium rare.  Let stand 30-40 minutes until internal temperature reaches 140 degrees before cutting.\r\n140 degrees is rare, 150 degrees is medium, 170 degrees is well done.",
  "ingredients": ["prime rib roast (figure approx. 1/2 lb. per person)", "2 tablespoons Worcestershire sauce", "1 1⁄2 tablespoons salt", "1 teaspoon pepper", "1⁄2 teaspoon white pepper", "1 1⁄2 teaspoons garlic powder", "1 1⁄2 teaspoons crushed thyme"],
  "yields": "10 serving(s)",
  "total_time": 130,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/40/91/51/pictBgeYa.jpg"
}, {
  "title": "Pulled Pork Sandwich",
  "instructions": "The Meat --.\nPlace the quartered onions in a crock pot.\nCombine brown sugar, paprika, salt and pepper: rub over the roast.\nPlace the roast over the onions in the crock pot.\nCombine the vinegar, Worcestershire Sauce, red pepper flakes, sugar, mustard, garlic salt and cayenne; stir to mix well.\nDrizzle about 1/2 of the vinegar mixture over the roast and cover.  Refrigerate the remaining vinegar mixture.\nCook on low for 8 hours.  Drizzle the other half of the vinegar mixture over the roast during the last 1/2 hour of cooking.\nWhile the meat is cooking, prepare the barbecue sauce.  Mix all ingredients except soy sauce, butter and smoke.  Simmer, uncovered, on low heat for 30 minutes.  Stir in the remaining ingredients and simmer, uncovered, for 10 more minutes.  Set aside to cool.\nRemove the meat from the crock pot and allow to rest for at least 15 minutes. (Very important step -- longer is better).\nRemove the onions and chop to a fine consistency.\nPull apart the meat with a couple of forks.  Meat should have a shredded look to it.\nMix chopped onions and shredded pork along with a little bit of juice from the crock pot to taste.  Add sufficient barbecue sauce to the mixture to achieve desired taste.  Meat should have distinctive barbecue flavor.\nTo serve, spread barbecue sauce on bottom of a hearty bun.\nPut layer of pulled pork on bun.  Spread barbecue sauce over meat.\nAdd layer of your favorite cole slaw on top of meat.  Layer some more barbecue sauce over cole slaw.\nSpread top of bun with more sauce.\nGrab a fist full of napkins, and enjoy.",
  "ingredients": ["Pulled Pork", "2 onions, quartered", "2 tablespoons light brown sugar", "1 tablespoon paprika", "2 teaspoons salt", "1⁄2 teaspoon black pepper", "4 -6 lbs boneless pork butt", "3⁄4 cup apple cider vinegar", "4 teaspoons Worcestershire sauce", "1 1⁄2 teaspoons crushed red pepper flakes", "1 1⁄2 teaspoons sugar", "1⁄2 teaspoon dry mustard (ie ( Colman's)", "1⁄2 teaspoon garlic salt", "1⁄4 teaspoon cayenne (Spice it up a bit with 1/2 tspn)", "Barbecue Sauce", "1 cup american style prepared yellow mustard (i.e. French's. Not Dijon, Gulden's, or any other type of spicy mustard.)", "1⁄2 cup sugar", "1⁄4 cup light brown sugar", "3⁄4 cup apple cider vinegar", "1⁄4 cup water", "2 tablespoons chili powder", "1 teaspoon black pepper", "1 teaspoon white pepper", "1⁄4 teaspoon cayenne", "1⁄2 teaspoon soy sauce", "2 tablespoons butter", "1 tablespoon liquid smoke", "Extras", "20 buns", "1 lb Coleslaw"],
  "yields": "22 serving(s)",
  "total_time": 540,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/11/61/73/yM0dqwDSRK6EwuxMU92D_PulledPork3.jpg"
}, {
  "title": "Ramen",
  "instructions": "Bring water to boil in a small sauce pan.\nAdd dried noodles and cook 3 minutes, or until noodles are tender.  Stir occasionally.\nDrain away water.  Return noodles to sauce pan.\nAdd butter, milk and contents of seasoning packet.\nIf your tastes desire, you may not use all of the seasoning packet.\nHeat on low heat and stir until butter is melted and noodles are coated with creamy sauce.\nServe.",
  "ingredients": ["1 (3 ounce) package ramen noodles, any flavor, with seasoning packet", "2 cups water", "2 tablespoons butter", "1⁄4 cup milk"],
  "yields": "2 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/13/34/48/ajTdwsRkQcKBjf9TInCs_untitled-1175.jpg"
}, {
  "title": "Ravioli",
  "instructions": "Pour about half of the pasta sauce in the bottom of crock pot.\nAdd frozen ravioli.\nPour additional pasta sauce, tomato sauce, water, and red pepper over ravioli (I usually pour the pasta sauce on first and then shake together the tomato sauce, water, and red pepper in the empty pasta sauce jar to mix them).\nSprinkle Italian seasonings over sauces.\nSprinkle cheese on top.\nTurn crock pot on low and cook for 4-5 hours (until ravioli are tender).",
  "ingredients": ["1 (25 ounce) bag beef ravioli", "1 (26 ounce) jar pasta sauce", "1 (8 ounce) can tomato sauce", "1 cup water", "2 -3 teaspoons red peppers", "Italian spices", "1 cup shredded mozzarella cheese"],
  "yields": "8 serving(s)",
  "total_time": 250,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/64/13/8/srBdzamQqeN2RnURsmmR-DSC_0727.JPG"
}, {
  "title": "Red Velvet Cake",
  "instructions": "For the cake: Preheat the oven to 350 degrees F.\nGrease and flour 2 (9-inch) cake pans.\nIn a medium bowl or on a piece of waxed paper, sift together flour, cocoa, baking soda, baking powder, and salt; set aside.\nIn a large bowl, cream together sugar and butter.\nBeat in eggs one at a time.\nAlternately add flour mixture and buttermilk.\nBeat in food coloring and vinegar, then add vanilla.\nSpread the batter evenly in the pans.\nBake for 20 to 30 minutes or until a wooden toothpick inserted into the center comes out clean.\nTurn out onto a rack to cool.\nFrosting: Blend cream cheese and butter together in a mixing bowl.\nAdd marshmallows and sugar and blend.\nFold in nuts.\nSpread between layers and on top and sides of cooled cake.",
  "ingredients": ["For the cake", "2 1⁄2 cups sifted cake flour", "2 tablespoons good quality cocoa powder", "1 teaspoon baking soda", "1 teaspoon baking powder", "1 teaspoon salt", "1 1⁄2 cups sugar", "1⁄2 cup unsalted butter, softened", "2 large eggs", "1 cup buttermilk", "2 ounces red food coloring", "1 teaspoon distilled white vinegar", "1 teaspoon vanilla", "For the Frosting", "1 (8 ounce) package cream cheese", "1⁄2 cup butter, softened", "1 cup melted marshmallows (you may use Fluff marshmallow creme to make it easier)", "1 (1 lb) box confectioners' sugar", "1 cup chopped pecans"],
  "yields": "8 serving(s)",
  "total_time": 45,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/21/33/93/pictf4ibg.jpg"
}, {
  "title": "Risotto",
  "instructions": "In a presssure cooker, heat 4tbs Olive oil and 2 Tbs Butter.  \r\nAdd onion and garlic.  Saute until translucent.\r\nAdd portabella and rice.  Stir until rice is coated with oil.  \r\nAdd Chicken broth. \r\nCover and cook under high pressure for 7 minutes. \r\nRelease pressure and add remaining 2 TBS of butter.  Stir in Parmesan cheese and serve.",
  "ingredients": ["4 tablespoons olive oil", "4 tablespoons butter, divided", "1 medium onion, diced", "2 garlic cloves, minced", "8 ounces portabella mushrooms, sliced", "1 1⁄2 cups arborio rice or 1 1/2 cups risotto rice", "4 cups chicken broth", "1 - 1 1⁄2 cup fresh grated parmigiano-reggiano cheese"],
  "yields": "6 serving(s)",
  "total_time": 30,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/25/33/58/h9QOy076SYOI9p9zKj6E_mushroom-risotto-5.jpg"
}, {
  "title": "Samosa",
  "instructions": "Mix together the flour, oil and salt.\nAdd a little water, until mixture becomes crumbly.\nKeep adding water, kneading the mixture till it becomes a soft pliable dough.\nCover with a moist cloth and set aside for 20 minutes.\nBeat dough on a work surface and knead again.\nCover and set aside.\nFILLING.\nHeat 3 tbsp oil.\nAdd ginger, garlic, green chillies and few coriander seeds.\nStir fry for 1 minute, add onions and saute till light brown.\nAdd cilantro (fresh coriander), lemon juice, turmeric, red chili, salt and garam masala.\nStir fry for 2 minutes.\nAdd potatoes.\nStir fry for 2 minutes.\nSet aside and allow to cool.\nDivide dough into 10 equal portions.\nUse a rolling pin, roll a piece of dough  into a 5\" oval.\nCut into 2 halves.\nRun a moist finger along the diameter.\nRoll around finger to make a cone.\nPlace a tablespoon of the filling into the cone.\nSeal the third side using a moist finger.\nDeep fry the samosas on low to medium heat until light brown.\nServe with tomato sauce or any chutney you love.",
  "ingredients": ["Pastry", "1 cup all-purpose flour", "2 tablespoons vegetable oil", "Filling", "2 large potatoes (boiled)", "1 onion, chopped", "2 green chilies, very finely chopped", "3 tablespoons oil", "1⁄2 teaspoon ginger, grated", "1⁄2 teaspoon garlic, crushed", "coriander seed", "1 tablespoon cilantro, finely chopped", "1⁄2 lemon, juice of", "1⁄2 teaspoon turmeric", "1⁄2 teaspoon garam masala", "1⁄2 teaspoon red chili powder", "salt"],
  "yields": "4 serving(s)",
  "total_time": 90,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/15/34/8/UlmzdKvSZK9YdR9Kdxwy_DSC08968.JPG"
}, {
  "title": "Sashimi",
  "instructions": "Slice the avocado lengthwise and remove the pit. Remove the skin and make thin slices of the avocado.\nCut the tuna into slices of 3-5 mm.\nIn a bowl, mix the sprouts with the cilantro, olive oil and lemon, place inside the center of the spiral.\nDecorate with balsamic reduction.",
  "ingredients": ["6 ounces fresh tuna", "1 avocado", "1 teaspoon cilantro", "1 teaspoon mixed sprouts", "1 tablespoon reduction balsamic vinegar", "1 tablespoon olive oil", "1⁄2 lemon, juice only"],
  "yields": "",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/53/81/15/LGQOUn3KTUS5iz7qP81Q_GVRN.jpg"
}, {
  "title": "Scallops",
  "instructions": "Roll scallops in bread crumbs.\nPut olive oil and butter in a large skillet; stir and heat until hot.\nAdd scallops, turning once, until browned on both sides (3-4 minutes); remove from heat.\nHalve lemon and gently squeeze juice over scallops, then sprinkle with cheese.\nCover with a lid and let steep for 5 minutes to allow the flavors to mingle.",
  "ingredients": ["1 lb sea scallops", "1⁄2 cup seasoned bread crumbs (approximately)", "1 tablespoon olive oil", "1 tablespoon butter", "1 lemon", "freshly grated romano cheese"],
  "yields": "4 serving(s)",
  "total_time": 15,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/13/49/51/tGSUVefORSCAEcZIcwuD_0S9A8614.jpg"
}, {
  "title": "Seaweed Salad",
  "instructions": "Soak seaweed in warm water to cover, 5 minutes. Drain, rinse then squeeze out excess water. If wakame is uncut, cut into 1/2-inch-wide strips.\r\nStir together vinegar, soy sauce, sesame oil, sugar, pepper flakes, ginger, and garlic in a bowl until sugar is dissolved. Add the seaweed, scallions, carrots, and cilantro, tossing to combine well. Sprinkle salad with sesame seeds.",
  "ingredients": ["3⁄4 ounce dried wakame seaweed (whole or cut)", "3 tablespoons rice vinegar (not seasoned)", "3 tablespoons soy sauce", "1 tablespoon sesame oil", "1 teaspoon sugar", "red pepper flakes", "1 teaspoon finely grated ginger", "1⁄2 teaspoon minced garlic", "2 scallions, thinly sliced", "1⁄4 cup shredded carrot", "2 tablespoons chopped fresh cilantro", "1 tablespoon sesame seeds, toasted"],
  "yields": "4 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/24/70/35/pic8znfnf.jpg"
}, {
  "title": "Shrimp And Grits",
  "instructions": "Bring first 4 ingredients to a boil in a medium saucepan; gradually whisk in grits; reduce heat and simmer, stirring occasionally, 10 minutes or until thickened; add cheddar cheese and next 4 ingredients; set aside but keep warm.\nCook bacon in a large skillet until crisp; remove bacon and drain on paper towels, reserve 1 tablespoon of drippings in skillet; crumble bacon and set aside.\nSprinkle shrimp with pepper and salt; dredge in flour.\nSaute mushrooms in hot drippings in skillet 5 minutes, or until tender; add green onions and saute 2 minutes; add shrimp and garlic and saute 2 minutes or until shrimp are lightly brown; stir in chicken broth, lemon juice and hot sauce and cook 2 more minutes, stirring to loosen browned bits from skillet.\nDivide grits into 4 large, shallow soup bowls; divide shrimp mixture into four servings and place on top of grits; top each serving with crumbled bacon and serve with lemon wedges.",
  "ingredients": ["2 cups water", "1 (14 1/2 ounce) can chicken broth", "3⁄4 cup half-and-half", "3⁄4 teaspoon salt", "1 cup regular grits (I used quick grits and they were fine)", "3⁄4 cup shredded cheddar cheese", "1⁄4 cup grated parmesan cheese", "2 tablespoons butter", "1⁄2 teaspoon Tabasco sauce", "1⁄4 teaspoon white pepper", "3 slices bacon", "1 lb medium shrimp, peeled and deveined", "1⁄4 teaspoon black pepper", "1⁄8 teaspoon salt", "1⁄4 cup flour", "1 cup sliced mushrooms", "1⁄2 cup sliced green onion", "2 cloves garlic, minced", "1⁄2 cup fat-free low-sodium chicken broth", "2 tablespoons fresh lemon juice", "1⁄4 teaspoon Tabasco sauce", "lemon wedge"],
  "yields": "4 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/90/00/0/csnRPzx1R7WNcdAZMgf4_shrimp-and-grits-3.jpg"
}, {
  "title": "Spaghetti Bolognese",
  "instructions": "Heat a large saucepan on the stove and add the butter.\r\nFry the onion, carrot and garlic for a few minutes, stirring all the time.\r\nAdd ground beef and cook for 4 minutes.\r\nAdd wine and tomato paste, simmer for 5 minutes.\r\nAdd broth and tomatoes.\r\nSimmer for 30-45 minutes before adding parsley, worcestershire sauce and plenty of salt and pepper.\r\nServe with cooked buttered pasta and freshly grated parmesan.",
  "ingredients": ["1 ounce butter", "1 large onion, diced", "1 large carrot, diced", "3 garlic cloves, minced", "1 lb ground beef", "2 1⁄2 cups red wine", "1⁄2 tablespoon tomato paste", "1 cup beef broth", "6 fresh tomatoes, chopped", "1 tablespoon fresh parsley, chopped", "1 tablespoon Worcestershire sauce", "salt and pepper", "Spaghetti", "11 ounces freshly cooked spaghetti", "1 ounce butter", "parmesan cheese"],
  "yields": "6 serving(s)",
  "total_time": 60,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/22/27/77/picNwxab8.jpg"
}, {
  "title": "Spaghetti Carbonara",
  "instructions": "Bring a large saucepan of water to a boil.\nIn a heavy medium skillet over medium heat add the olive oil and pancetta and cook until pancetta is browned - 3-4 minute Remove from skillet and keep warm.\nCook spaghetti in boiling water until al dente, about 8 minute.\nWhile spaghetti is cooking, whisk cream, egg yolks, Parmesan cheese, salt and pepper in a medium bowl until well combined.\nDrain pasta, and return to saucepan. Immediately stir in egg/cheese mixture until well combined.\nAdd warm pancetta and fat from pan. Toss well.\nThin sauce with additional cream, if necessary. Serve immediately with more Parmesan cheese as a garnish.",
  "ingredients": ["1 tablespoon olive oil", "10 ounces pancetta, cut into 1/2-inch dice", "1 lb spaghetti", "1 cup heavy cream", "4 large egg yolks", "2 cups parmesan cheese, grated (5 oz.)", "1 teaspoon salt", "1⁄4 teaspoon black pepper"],
  "yields": "6 serving(s)",
  "total_time": 35,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/17/43/33/pic9jqyhr.jpg"
}, {
  "title": "Spring Rolls",
  "instructions": "Heat the peanut oil in a wok. When hot, stir fry the carrot for 1 minute. Add the cabbage, mushroom, and chicken and fry for another minute, stirring all of the time.\nSeason with a little pepper; add the sugar, both soy sauces and the sesame oil.\nCombine 2 tsp of the cornflour with about 3 tbsp of water and stir into the filling while still on the heat. Any juices will soon thicken. Remove from heat and leave to cool.\nCombine remaining cornflour with enough water to make a thin paste. Lay out a spring roll wrapper and put 1 tbsp of filling across one end. brush the edges of the wrapper with cornflour liquid to help it stick.\nFold the two opposite edges of the wrapper over part of the filling and roll into a tight cylinder. Pinch the edges together to form a good seal.\nRepeat with remaining wrappers and filling.\nHeat the vegetable oil in a deep fryer, and cook rolls in batches until golden and crisp.",
  "ingredients": ["2 tablespoons peanut oil", "1 medium carrot (shredded)", "1 small cabbage (shredded)", "100 g mushrooms, thinly sliced", "200 g cooked chicken (shredded)", "1 pinch white pepper", "3 teaspoons caster sugar", "1 tablespoon light soy sauce", "1 teaspoon dark soy sauce", "2 teaspoons sesame oil", "2 tablespoons cornflour", "30 spring roll wrappers", "vegetable oil (for frying)"],
  "yields": "",
  "total_time": 50,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/31/93/50/piceQASdi.jpg"
}, {
  "title": "Steak",
  "instructions": "Combine 1/4 cup soup with ground beef, bread crumbs, egg, onion, salt, pepper, and garlic salt; mix well.\nShape into 6 patties.\nPlace in shallow baking dish.\nBake at 350 degrees for 40 minutes.\nDrain off fat.\nCombine remaining soup and water; pour over patties.\nBake an additional 10 minutes or until thoroughly heated.",
  "ingredients": ["1 (10 1/2 ounce) can condensed golden mushroom soup, undiluted and divided", "1 1⁄2 lbs ground round", "1⁄2 cup dry breadcrumbs", "1 large egg, beaten", "1⁄2 cup chopped onion", "salt and pepper", "garlic salt or garlic powder", "1⁄3 cup water"],
  "yields": "6 serving(s)",
  "total_time": 65,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/29/83/3/picdnrhjb.jpg"
}, {
  "title": "Strawberry Shortcake",
  "instructions": "Wash, stem, and cut strawberries in half.\nAdd sugar; toss to mix well.\nChill.\nBeat cream cheese and powdered sugar well.\nFold in whipped topping and cake cubes.\nSpread cake into an ungreased 13x9 dish.\nCover and chill for at least 2 hours.\nCut cake into squares; top with strawberries.",
  "ingredients": ["1 quart fresh strawberries (or more if you like)", "1⁄2 cup sugar", "8 ounces cream cheese, softened", "1 cup powdered sugar", "1 (8 ounce) container frozen whipped topping", "1 (14 ounce) angel food cake, cut into cubes (I buy the cake already made)"],
  "yields": "12 serving(s)",
  "total_time": 20,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/24/67/2/q11AXp9CRSunElxDF5RU_The%20ultimate%20strawberry%20shortcake%2024672-4.jpg"
}, {
  "title": "Sushi",
  "instructions": "For the seasoned vinegar: Combine ingredients in a small sauce pan over med-low heat until sugar and salt are dissolved.\nAllow to cool and store in the refrigerator.\nFor the rice: Put 3 cups of rice in a large bowl and rinse until the water is clear.\nDrain the rice and add the 3 cups of cold water to a pot with a good-fitting lid.\nDO not cover the pot yet, though.\nOver high heat, bring to a simmer.\nOnce the rice is simmering, cover rice and reduce the heat to medium low.\nCook for 10 minutes without removing the pot lid at all.\nTurn heat down to the lowest setting and cook for another 10 minutes.\nNow, turn off the heat and let the rice sit in the pot ON the stove for 15 minutes.\nTurn the rice into a wooden, glass, or stainless steel bowl and sprinkle with 6 tbsp of seasoned vinegar.\nMix the vinegar with the rice with a cutting motion being careful to only mix for about 5 minutes Max.\nCover rice with a damp towel and allow to cool to room temperature.\nThis rice is easiest to manipulate while it is room temperature or warmer.\nIf you refrigerate the rice it gets harder to work, but you could save it for leftovers--just keep it covered with a damp cloth.\nThis makes enough for about 10 rolls of Maki-sushi or 60 pieces of Nigiri-sushi.",
  "ingredients": ["For the seasoning", "1 cup rice wine vinegar", "1⁄2 cup superfine sugar", "1⁄4 cup sea salt (you can use regular salt, but sea salt seems to dissolve better)", "For the actual rice", "3 cups japanese rice (I use Nishiki Brand)", "3 cups cold water", "6 tablespoons of seasoned vinegar"],
  "yields": "5 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/55/24/3/picjmXyLQ.jpg"
}, {
  "title": "Tacos",
  "instructions": "Combine sauce ingredients and stir until smooth.\nGrill chicken in vegetable oil and cut into thin slices.\nPreheat skillet over medium heat.\nOne at a time, lay tortilla into hot skillet and sprinkle with 1/4 cup of each shredded cheese and 1/2 cheese slice on one side of the tortilla.\nArrange about 1/4 cup chicken slices over tortilla on the same half covered with cheese.\nOn the empty side, spread about one tablespoon of sauce.\nFold over, and press gently with spatula.\nCook until cheese is melted and slice each into 4 pieces.",
  "ingredients": ["SAUCE", "1⁄4 cup mayonnaise", "2 teaspoons minced jalapenos, slices", "2 teaspoons jalapeno juice, from minced jalepenos", "3⁄4 teaspoon sugar", "1⁄2 teaspoon cumin", "1⁄2 teaspoon paprika", "1⁄8 teaspoon cayenne pepper", "1⁄8 teaspoon garlic powder", "1 dash salt", "QUESADILLAS", "4 flour tortillas", "4 chicken tenderloins", "1 cup shredded cheddar cheese", "1 cup shredded monterey jack cheese", "2 slices process American cheese"],
  "yields": "4 serving(s)",
  "total_time": 25,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/78/19/4/A1LIV5kGTCWalhYNPucT_TBQ%207%20-%20final_5.jpg"
}, {
  "title": "Takoyaki",
  "instructions": "Warm up iron plate and oil the surface.\r\nPut the batter into half of hole.\r\nThen put octopus and other fillings into the hole.\r\nAdd the batter full.\r\nWhen batter on the edge of the molds become cooked, turn over takoyaki with pick.\r\nWhen batter browns turn over to form balls. Continue to heat while turning it over and over until balls become evenly browned and well cooked inside. \r\nServe on plate, top with sauce, powdered dried bonito and aonori to taste desired.",
  "ingredients": ["BATTER", "100 g flour", "1 egg", "350 ml water", "Fillings", "100 g boiled octopus (cut into 1cm square)", "50 g cabbage (chopped)", "10 g green onions (scallions chopped)", "20 g fish scraps (tenkasu)", "yakisoba sauce or okonomiyaki sauce", "ao nori (seaweed)", "dried bonito flakes", "mayonnaise (optional)"],
  "yields": "60 serving(s)",
  "total_time": 10,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/gk-static/fdc-new/img/fdc-shareGraphic.png"
}, {
  "title": "Tiramisu",
  "instructions": "Put the egg yolks and sugar in a large bowl.\nBeat with electric mixers until the mixture goes pale and thick.\nAdd mascarpone and beat until combined.\nIt does not matter if it is marbled slightly.\nWhip the cream until stiff peaks hold, and fold gently into the egg mixture.\nI use a spatula, but you could use a metal spoon.\nDo not beat!\nBeat the egg whites to soft peaks in a perfectly clean metal bowl.\nIf there is any grease, they won't whip properly.\nMake sure you rinse and dry your beaters well.\nFold the whites into the cream.\nIt is very important to retain as much air as possible.\nFor serving you can use a big dish or individual glasses.\nIf using a big dish: Put the coffee and liquer in a bowl.\nDip biscuits in coffee one at a time.\nDrain well.\nLayer in your dish, covering the whole bottom.\nPlace half of the mascarpone mix on top and spread out.\nRepeat with remaining biscuits and mascarpone, finishing with a creamy layer.\nSmooth surface.\nDust with cocoa.\nRefrigerate for at least 2 hours, but it works quite well if you leave for up to 24 hours.\nIf using glasses: Break the biscuits up into pieces that will fit your glasses and do the same soaking and layering as before.",
  "ingredients": ["2 -3 cups strong plunger espresso coffee, cooled to room temp", "3 tablespoons Tia Maria (or another liqueur, but the coffee flavour is really enhanced)", "2 eggs, separated", "1⁄4 cup caster sugar", "250 g mascarpone cheese", "1 cup cream (anything that will hold the peaks heavy whipping cream works fine as will anything 36% milkfat or hi)", "250 g ladyfingers (savoiardi)", "cocoa powder, for dusting"],
  "yields": "6 serving(s)",
  "total_time": 150,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/84/61/2/4JF4RJ1CT2ixSctqJGOs_DSC_0227-3.jpg"
}, {
  "title": "Tuna Tartare",
  "instructions": "Whisk to gether the yolk, dijon and oil until well blended.\r\nAdd the onion, dill, lemon juice, A1, salt and pepper.  Mix well.\r\nFold in tuna to coat.  \r\nCover.  Chill 1 hour.\r\nMound on a platter, surround with rest.",
  "ingredients": ["1 egg yolk", "2 tablespoons Dijon mustard", "2 tablespoons olive oil", "1 small onion (minced)", "2 tablespoons dill (minced)", "3 tablespoons lemon juice", "1⁄2 teaspoon A.1. Original Sauce", "1⁄4 teaspoon salt", "1⁄4 teaspoon fresh cracked pepper", "1 lb fresh sushi grade tuna (julienned)", "thin slices black bread", "thin slices plum tomato", "dill sprigs"],
  "yields": "8 serving(s)",
  "total_time": 90,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/16/45/16/picRF8XZC.jpg"
}, {
  "title": "Waffles",
  "instructions": "Oil the waffle maker.\nSift the dry ingredients together in a large bowl.\nIn separate bowl, separate egg whites and beat until stiff peaks form.\nIn a separate bowl, mix together the egg yolks, milk, oil , and vanilla, stir slightly.\nAdd to dry ingredients and mix well.\nFold in egg whites.\nCook in waffle iron on medium-high heat for around 5-10 minutes.",
  "ingredients": ["2 cups flour", "4 teaspoons baking powder", "1⁄2 teaspoon salt", "1⁄4 cup sugar", "2 eggs", "1⁄2 cup vegetable oil", "2 cups milk", "1 teaspoon vanilla"],
  "yields": "6 serving(s)",
  "total_time": 40,
  "img": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/63/07/1/Oey61BTvKAEV0tVQz4gU_untitled-1868.jpg"
},